qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/USART_LPC5411x.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2016 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        21. August 2016
 * $Revision:    V1.1
 *
 * Driver:       Driver_USART0, Driver_USART1, Driver_USART2, Driver_USART3
 *               Driver_USART4, Driver_USART5, Driver_USART6, Driver_USART7
 *
 * Configured:   via RTE_Device.h configuration file
 * Project:      USART Driver for NXP LPC5411x
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                   Value   UART Interface
 *   ---------------------                   -----   --------------
 *   Connect to hardware via Driver_USART# = 0       use USART0
 *   Connect to hardware via Driver_USART# = 1       use USART1
 *   Connect to hardware via Driver_USART# = 2       use USART2
 *   Connect to hardware via Driver_USART# = 3       use USART3
 *   Connect to hardware via Driver_USART# = 4       use USART4
 *   Connect to hardware via Driver_USART# = 5       use USART5
 *   Connect to hardware via Driver_USART# = 6       use USART6
 *   Connect to hardware via Driver_USART# = 7       use USART7
 *
 * NOTE:
 *   When DMA is used, DMA_IRQHandler, in keil_startup_lpc5411x.s, 
 *   must be overwritten with Chip_DMASERVICE_Isr !
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.1
 *    - Code which has been bypassing a bug in Chip_DMASERVICE_SingleBuffer() is updated, due to 
 *      correction of the Chip_DMASERVICE_SingleBuffer() function.
 *  Version 1.0
 *    - Initial release
 */
#include "USART_LPC5411x.h"

#define ARM_USART_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,1)

#if (    (!RTE_USART0) && (!RTE_USART1) && (!RTE_USART2) && (!RTE_USART3) \
      && (!RTE_USART4) && (!RTE_USART5) && (!RTE_USART6) && (!RTE_USART7) )
#error "USART not enabled in RTE_Device.h!"
#endif

// User Defines
// Can be user defined by C preprocessor


// USART Fractional divider
// Note:
//  - USART fractional divider is common for all USARTs.
//  - Changing fractional divider effects all USART baudrate settings
// USART clock  = async bridge clk / (1 + USARTx_FRGCTRL_MUL / 255)
// USARTx_FRGCTRL_MUL: 0 - 255: user defined mul values
//                     256    : fractional divider will be calculated,
//                              all USARTx baurates will be effected
#ifndef USARTx_FRGCTRL_MUL
#define USARTx_FRGCTRL_MUL        256
#endif

// Oversample selection
// USARTx_OVERSAMPLE: 5 - 16
#ifndef USART0_OVERSAMPLE
#define USART0_OVERSAMPLE         16
#endif
#ifndef USART1_OVERSAMPLE
#define USART1_OVERSAMPLE         16
#endif
#ifndef USART2_OVERSAMPLE
#define USART2_OVERSAMPLE         16
#endif
#ifndef USART3_OVERSAMPLE
#define USART3_OVERSAMPLE         16
#endif
#ifndef USART4_OVERSAMPLE
#define USART4_OVERSAMPLE         16
#endif
#ifndef USART5_OVERSAMPLE
#define USART5_OVERSAMPLE         16
#endif
#ifndef USART6_OVERSAMPLE
#define USART6_OVERSAMPLE         16
#endif
#ifndef USART7_OVERSAMPLE
#define USART7_OVERSAMPLE         16
#endif

// Trigger level definitions (trig_level: 0 .. 15)
#ifndef USART0_TX_TRIG_LEVEL
#define USART0_TX_TRIG_LEVEL      0
#endif
#ifndef USART0_RX_TRIG_LEVEL
#define USART0_RX_TRIG_LEVEL      0
#endif
#ifndef USART1_TX_TRIG_LEVEL
#define USART1_TX_TRIG_LEVEL      0
#endif
#ifndef USART1_RX_TRIG_LEVEL
#define USART1_RX_TRIG_LEVEL      0
#endif
#ifndef USART2_TX_TRIG_LEVEL
#define USART2_TX_TRIG_LEVEL      0
#endif
#ifndef USART2_RX_TRIG_LEVEL
#define USART2_RX_TRIG_LEVEL      0
#endif
#ifndef USART3_TX_TRIG_LEVEL
#define USART3_TX_TRIG_LEVEL      0
#endif
#ifndef USART3_RX_TRIG_LEVEL
#define USART3_RX_TRIG_LEVEL      0
#endif
#ifndef USART4_TX_TRIG_LEVEL
#define USART4_TX_TRIG_LEVEL      0
#endif
#ifndef USART4_RX_TRIG_LEVEL
#define USART4_RX_TRIG_LEVEL      0
#endif
#ifndef USART5_TX_TRIG_LEVEL
#define USART5_TX_TRIG_LEVEL      0
#endif
#ifndef USART5_RX_TRIG_LEVEL
#define USART5_RX_TRIG_LEVEL      0
#endif
#ifndef USART6_TX_TRIG_LEVEL
#define USART6_TX_TRIG_LEVEL      0
#endif
#ifndef USART6_RX_TRIG_LEVEL
#define USART6_RX_TRIG_LEVEL      0
#endif
#ifndef USART7_TX_TRIG_LEVEL
#define USART7_TX_TRIG_LEVEL      0
#endif
#ifndef USART7_RX_TRIG_LEVEL
#define USART7_RX_TRIG_LEVEL      0
#endif

// Driver Version
static const ARM_DRIVER_VERSION usart_driver_version = { ARM_USART_API_VERSION, ARM_USART_DRV_VERSION };

// USART0
#if (RTE_USART0)
static USART_INFO USART0_Info = { 0 };
#if (RTE_USART0_TXD_PIN_EN == 1)
  static PINMUX_GRP_T USART0_pin_tx  = { RTE_USART0_TXD_PORT,  RTE_USART0_TXD_BIT,  RTE_USART0_TXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART0_RXD_PIN_EN == 1)
  static PINMUX_GRP_T USART0_pin_rx  = { RTE_USART0_RXD_PORT,  RTE_USART0_RXD_BIT,  RTE_USART0_RXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART0_SCK_PIN_EN == 1)
  static PINMUX_GRP_T USART0_pin_clk = { RTE_USART0_SCK_PORT,  RTE_USART0_SCK_BIT,  RTE_USART0_SCK_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART0_CTS_PIN_EN == 1)
  static PINMUX_GRP_T USART0_pin_cts = { RTE_USART0_CTS_PORT,  RTE_USART0_CTS_BIT,  RTE_USART0_CTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART0_RTS_PIN_EN == 1)
  static PINMUX_GRP_T USART0_pin_rts = { RTE_USART0_RTS_PORT,  RTE_USART0_RTS_BIT,  RTE_USART0_RTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif

// DMA
#if (USART0_TX_DMA_EN != 0)
static       void      USART0_TX_DMA_Callback (int32_t event);
static const USART_DMA USART0_TX_DMA = { DMAREQ_USART0_TX, &USART0_TX_DMA_Callback, };
#endif
#if (USART0_RX_DMA_EN != 0)
static       void      USART0_RX_DMA_Callback (int32_t event);
static const USART_DMA USART0_RX_DMA = { DMAREQ_USART0_RX, &USART0_RX_DMA_Callback, };
#endif

static const USART_RESOURCES USART0_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#if (RTE_USART0_SCLK_PIN_EN == 1)
    1,  // supports Synchronous Master mode
    1,  // supports Synchronous Slave mode
#else
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
#endif
    0,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#if (RTE_USART0_RTS_PIN_EN == 1)
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#if (RTE_USART0_RTS_PIN_EN == 1)
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    0,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
#if (RTE_USART0_RTS_PIN_EN == 1)
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#if (RTE_USART0_CTS_PIN_EN == 1)
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#if (RTE_USART0_CTS_PIN_EN == 1)
    1,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0,  // Signal RI change event: \ref ARM_USART_EVENT_RI
  },
    LPC_USART0,
  {     // USART Pin Configuration
#if (RTE_USART0_TXD_PIN_EN == 1)
    &USART0_pin_tx,
#else
    NULL,
#endif
#if (RTE_USART0_RXD_PIN_EN == 1)
    &USART0_pin_rx,
#else
    NULL,
#endif
#if (RTE_USART0_SCLK_PIN_EN == 1)
    &USART0_pin_clk,
#else
    NULL,
#endif
#if (RTE_USART0_CTS_PIN_EN == 1)
    &USART0_pin_cts,
#else
    NULL,
#endif
#if (RTE_USART0_RTS_PIN_EN == 1)
    &USART0_pin_rts,
#else
    NULL,
#endif
  },

  // TX DMA
#if (USART0_TX_DMA_EN != 0)
  &USART0_TX_DMA,
#else
  NULL,
#endif

  // RX_DMA
#if (USART0_RX_DMA_EN != 0)
  &USART0_RX_DMA,
#else
  NULL,
#endif
    USART0_SYSCON_CLOCK,
    USART0_RESET,
    USART0_OVERSAMPLE,
    USART0_TX_TRIG_LEVEL,
    USART0_RX_TRIG_LEVEL,
    USART0_IRQn,
    &USART0_Info,
};
#endif

// USART1
#if (RTE_USART1)
static USART_INFO USART1_Info = { 0 };
#if (RTE_USART1_TXD_PIN_EN == 1)
  static PINMUX_GRP_T USART1_pin_tx  = { RTE_USART1_TXD_PORT,   RTE_USART1_TXD_BIT,   RTE_USART1_TXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART1_RXD_PIN_EN == 1)
  static PINMUX_GRP_T USART1_pin_rx  = { RTE_USART1_RXD_PORT,   RTE_USART1_RXD_BIT,   RTE_USART1_RXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART1_SCLK_PIN_EN == 1)
  static PINMUX_GRP_T USART1_pin_clk = { RTE_USART1_SCLK_PORT,  RTE_USART1_SCLK_BIT,  RTE_USART1_SCLK_FUNC | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART1_CTS_PIN_EN == 1)
  static PINMUX_GRP_T USART1_pin_cts = { RTE_USART1_CTS_PORT,   RTE_USART1_CTS_BIT,   RTE_USART1_CTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART1_RTS_PIN_EN == 1)
  static PINMUX_GRP_T USART1_pin_rts = { RTE_USART1_RTS_PORT,   RTE_USART1_RTS_BIT,   RTE_USART1_RTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif

// DMA
#if (USART1_TX_DMA_EN != 0)
static       void      USART1_TX_DMA_Callback (int32_t event);
static const USART_DMA USART1_TX_DMA = { DMAREQ_USART1_TX, &USART1_TX_DMA_Callback, };
#endif
#if (USART1_RX_DMA_EN != 0)
static       void      USART1_RX_DMA_Callback (int32_t event);
static const USART_DMA USART1_RX_DMA = { DMAREQ_USART1_RX, &USART1_RX_DMA_Callback, };
#endif

static const USART_RESOURCES USART1_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#if (RTE_USART1_SCLK_PIN_EN == 1)
    1,  // supports Synchronous Master mode
    1,  // supports Synchronous Slave mode
#else
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
#endif
    0,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#if (RTE_USART1_RTS_PIN_EN == 1)
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#if (RTE_USART1_RTS_PIN_EN == 1)
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    0,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
#if (RTE_USART1_RTS_PIN_EN == 1)
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#if (RTE_USART1_CTS_PIN_EN == 1)
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#if (RTE_USART1_CTS_PIN_EN == 1)
    1,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0,  // Signal RI change event: \ref ARM_USART_EVENT_RI
  },
    LPC_USART1,
  {     // USART Pin Configuration
#if (RTE_USART1_TXD_PIN_EN == 1)
    &USART1_pin_tx,
#else
    NULL,
#endif
#if (RTE_USART1_RXD_PIN_EN == 1)
    &USART1_pin_rx,
#else
    NULL,
#endif
#if (RTE_USART1_SCLK_PIN_EN == 1)
    &USART1_pin_clk,
#else
    NULL,
#endif
#if (RTE_USART1_CTS_PIN_EN == 1)
    &USART1_pin_cts,
#else
    NULL,
#endif
#if (RTE_USART1_RTS_PIN_EN == 1)
    &USART1_pin_rts,
#else
    NULL,
#endif
  },
  // TX DMA
#if (USART1_TX_DMA_EN != 0)
  &USART1_TX_DMA,
#else
  NULL,
#endif

  // RX_DMA
#if (USART1_RX_DMA_EN != 0)
  &USART1_RX_DMA,
#else
  NULL,
#endif
    USART1_SYSCON_CLOCK,
    USART1_RESET,
    USART1_OVERSAMPLE,
    USART1_TX_TRIG_LEVEL,
    USART1_RX_TRIG_LEVEL,
    USART1_IRQn,
    &USART1_Info,
};
#endif

// USART2 
#if (RTE_USART2)
static USART_INFO USART2_Info = { 0 };
#if (RTE_USART2_TXD_PIN_EN == 1)
  static PINMUX_GRP_T USART2_pin_tx  = { RTE_USART2_TXD_PORT,   RTE_USART2_TXD_BIT,   RTE_USART2_TXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART2_RXD_PIN_EN == 1)
  static PINMUX_GRP_T USART2_pin_rx  = { RTE_USART2_RXD_PORT,   RTE_USART2_RXD_BIT,   RTE_USART2_RXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART2_SCLK_PIN_EN == 1)
  static PINMUX_GRP_T USART2_pin_clk = { RTE_USART2_SCLK_PORT,  RTE_USART2_SCLK_BIT,  RTE_USART2_SCLK_FUNC | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART2_CTS_PIN_EN == 1)
  static PINMUX_GRP_T USART2_pin_cts = { RTE_USART2_CTS_PORT,   RTE_USART2_CTS_BIT,   RTE_USART2_CTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART2_RTS_PIN_EN == 1)
  static PINMUX_GRP_T USART2_pin_rts = { RTE_USART2_RTS_PORT,   RTE_USART2_RTS_BIT,   RTE_USART2_RTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif

// DMA
#if (USART2_TX_DMA_EN != 0)
static       void      USART2_TX_DMA_Callback (int32_t event);
static const USART_DMA USART2_TX_DMA = { DMAREQ_USART2_TX, &USART2_TX_DMA_Callback, };
#endif
#if (USART2_RX_DMA_EN != 0)
static       void      USART2_RX_DMA_Callback (int32_t event);
static const USART_DMA USART2_RX_DMA = { DMAREQ_USART2_RX, &USART2_RX_DMA_Callback, };
#endif

