qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/USART_LPC5411x.c
static const USART_RESOURCES USART2_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#if (RTE_USART2_SCLK_PIN_EN == 1)
    1,  // supports Synchronous Master mode
    1,  // supports Synchronous Slave mode
#else
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
#endif
    0,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#if (RTE_USART2_RTS_PIN_EN == 1)
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#if (RTE_USART2_RTS_PIN_EN == 1)
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    0,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
#if (RTE_USART2_RTS_PIN_EN == 1)
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#if (RTE_USART2_CTS_PIN_EN == 1)
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#if (RTE_USART2_CTS_PIN_EN == 1)
    1,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0,  // Signal RI change event: \ref ARM_USART_EVENT_RI
  },
    LPC_USART2,
  {     // USART Pin Configuration
#if (RTE_USART2_TXD_PIN_EN == 1)
    &USART2_pin_tx,
#else
    NULL,
#endif
#if (RTE_USART2_RXD_PIN_EN == 1)
    &USART2_pin_rx,
#else
    NULL,
#endif
#if (RTE_USART2_SCLK_PIN_EN == 1)
    &USART2_pin_clk,
#else
    NULL,
#endif
#if (RTE_USART2_CTS_PIN_EN == 1)
    &USART2_pin_cts,
#else
    NULL,
#endif
#if (RTE_USART2_RTS_PIN_EN == 1)
    &USART2_pin_rts,
#else
    NULL,
#endif
  },
  // TX DMA
#if (USART2_TX_DMA_EN != 0)
  &USART2_TX_DMA,
#else
  NULL,
#endif

  // RX_DMA
#if (USART2_RX_DMA_EN != 0)
  &USART2_RX_DMA,
#else
  NULL,
#endif
    USART2_SYSCON_CLOCK,
    USART2_RESET,
    USART2_OVERSAMPLE,
    USART2_TX_TRIG_LEVEL,
    USART2_RX_TRIG_LEVEL,
    USART2_IRQn,
    &USART2_Info,
};
#endif

// USART3
#if (RTE_USART3)
  static USART_INFO USART3_Info = { 0 };
#if (RTE_USART3_TXD_PIN_EN == 1)
  static PINMUX_GRP_T USART3_pin_tx  = { RTE_USART3_TXD_PORT,   RTE_USART3_TXD_BIT,   RTE_USART3_TXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART3_RXD_PIN_EN == 1)
  static PINMUX_GRP_T USART3_pin_rx  = { RTE_USART3_RXD_PORT,   RTE_USART3_RXD_BIT,   RTE_USART3_RXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART3_SCLK_PIN_EN == 1)
  static PINMUX_GRP_T USART3_pin_clk = { RTE_USART3_SCLK_PORT,  RTE_USART3_SCLK_BIT,  RTE_USART3_SCLK_FUNC | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART3_CTS_PIN_EN == 1)
  static PINMUX_GRP_T USART3_pin_cts = { RTE_USART3_CTS_PORT,   RTE_USART3_CTS_BIT,   RTE_USART3_CTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART3_RTS_PIN_EN == 1)
  static PINMUX_GRP_T USART3_pin_rts = { RTE_USART3_RTS_PORT,   RTE_USART3_RTS_BIT,   RTE_USART3_RTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif

// DMA
#if (USART3_TX_DMA_EN != 0)
static       void      USART3_TX_DMA_Callback (int32_t event);
static const USART_DMA USART3_TX_DMA = { DMAREQ_USART3_TX, &USART3_TX_DMA_Callback, };
#endif
#if (USART3_RX_DMA_EN != 0)
static       void      USART3_RX_DMA_Callback (int32_t event);
static const USART_DMA USART3_RX_DMA = { DMAREQ_USART3_RX, &USART3_RX_DMA_Callback, };
#endif

static const USART_RESOURCES USART3_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#if (RTE_USART3_SCLK_PIN_EN == 1)
    1,  // supports Synchronous Master mode
    1,  // supports Synchronous Slave mode
#else
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
#endif
    0,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#if (RTE_USART3_RTS_PIN_EN == 1)
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#if (RTE_USART3_RTS_PIN_EN == 1)
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    0,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
#if (RTE_USART3_RTS_PIN_EN == 1)
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#if (RTE_USART3_CTS_PIN_EN == 1)
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#if (RTE_USART3_CTS_PIN_EN == 1)
    1,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0,  // Signal RI change event: \ref ARM_USART_EVENT_RI
  },
    LPC_USART3,
  {     // USART Pin Configuration
#if (RTE_USART3_TXD_PIN_EN == 1)
    &USART3_pin_tx,
#else
    NULL,
#endif
#if (RTE_USART3_RXD_PIN_EN == 1)
    &USART3_pin_rx,
#else
    NULL,
#endif
#if (RTE_USART3_SCLK_PIN_EN == 1)
    &USART3_pin_clk,
#else
    NULL,
#endif
#if (RTE_USART3_CTS_PIN_EN == 1)
    &USART3_pin_cts,
#else
    NULL,
#endif
#if (RTE_USART3_RTS_PIN_EN == 1)
    &USART3_pin_rts,
#else
    NULL,
#endif
  },
  // TX DMA
#if (USART3_TX_DMA_EN != 0)
  &USART3_TX_DMA,
#else
  NULL,
#endif

  // RX_DMA
#if (USART3_RX_DMA_EN != 0)
  &USART3_RX_DMA,
#else
  NULL,
#endif
    USART3_SYSCON_CLOCK,
    USART3_RESET,
    USART3_OVERSAMPLE,
    USART3_TX_TRIG_LEVEL,
    USART3_RX_TRIG_LEVEL,
    USART3_IRQn,
    &USART3_Info,
};
#endif

// USART4
#if (RTE_USART4)
static USART_INFO USART4_Info = { 0 };
#if (RTE_USART4_TXD_PIN_EN == 1)
  static PINMUX_GRP_T USART4_pin_tx  = { RTE_USART4_TXD_PORT,  RTE_USART4_TXD_BIT,  RTE_USART4_TXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART4_RXD_PIN_EN == 1)
  static PINMUX_GRP_T USART4_pin_rx  = { RTE_USART4_RXD_PORT,  RTE_USART4_RXD_BIT,  RTE_USART4_RXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART4_SCK_PIN_EN == 1)
  static PINMUX_GRP_T USART4_pin_clk = { RTE_USART4_SCK_PORT,  RTE_USART4_SCK_BIT,  RTE_USART4_SCK_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART4_CTS_PIN_EN == 1)
  static PINMUX_GRP_T USART4_pin_cts = { RTE_USART4_CTS_PORT,  RTE_USART4_CTS_BIT,  RTE_USART4_CTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART4_RTS_PIN_EN == 1)
  static PINMUX_GRP_T USART4_pin_rts = { RTE_USART4_RTS_PORT,  RTE_USART4_RTS_BIT,  RTE_USART4_RTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif

// DMA
#if (USART4_TX_DMA_EN != 0)
static       void      USART4_TX_DMA_Callback (int32_t event);
static const USART_DMA USART4_TX_DMA = { DMAREQ_USART4_TX, &USART4_TX_DMA_Callback, };
#endif
#if (USART4_RX_DMA_EN != 0)
static       void      USART4_RX_DMA_Callback (int32_t event);
static const USART_DMA USART4_RX_DMA = { DMAREQ_USART4_RX, &USART4_RX_DMA_Callback, };
#endif

static const USART_RESOURCES USART4_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#if (RTE_USART4_SCLK_PIN_EN == 1)
    1,  // supports Synchronous Master mode
    1,  // supports Synchronous Slave mode
#else
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
#endif
    0,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#if (RTE_USART4_RTS_PIN_EN == 1)
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#if (RTE_USART4_RTS_PIN_EN == 1)
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    0,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
#if (RTE_USART4_RTS_PIN_EN == 1)
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#if (RTE_USART4_CTS_PIN_EN == 1)
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#if (RTE_USART4_CTS_PIN_EN == 1)
    1,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0,  // Signal RI change event: \ref ARM_USART_EVENT_RI
  },
    LPC_USART4,
  {     // USART Pin Configuration
#if (RTE_USART4_TXD_PIN_EN == 1)
    &USART4_pin_tx,
#else
    NULL,
#endif
#if (RTE_USART4_RXD_PIN_EN == 1)
    &USART4_pin_rx,
#else
    NULL,
#endif
#if (RTE_USART4_SCLK_PIN_EN == 1)
    &USART4_pin_clk,
#else
    NULL,
#endif
#if (RTE_USART4_CTS_PIN_EN == 1)
    &USART4_pin_cts,
#else
    NULL,
#endif
#if (RTE_USART4_RTS_PIN_EN == 1)
    &USART4_pin_rts,
#else
    NULL,
#endif
  },
  // TX DMA
#if (USART4_TX_DMA_EN != 0)
  &USART4_TX_DMA,
#else
  NULL,
#endif

  // RX_DMA
#if (USART4_RX_DMA_EN != 0)
  &USART4_RX_DMA,
#else
  NULL,
#endif
    USART4_SYSCON_CLOCK,
    USART4_RESET,
    USART4_OVERSAMPLE,
    USART4_TX_TRIG_LEVEL,
    USART4_RX_TRIG_LEVEL,
    USART4_IRQn,
    &USART4_Info,
};
#endif

