qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/USART_LPC5411x.c
// USART5
#if (RTE_USART5)
static USART_INFO USART5_Info = { 0 };
#if (RTE_USART5_TXD_PIN_EN == 1)
  static PINMUX_GRP_T USART5_pin_tx  = { RTE_USART5_TXD_PORT,  RTE_USART5_TXD_BIT,  RTE_USART5_TXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART5_RXD_PIN_EN == 1)
  static PINMUX_GRP_T USART5_pin_rx  = { RTE_USART5_RXD_PORT,  RTE_USART5_RXD_BIT,  RTE_USART5_RXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART5_SCK_PIN_EN == 1)
  static PINMUX_GRP_T USART5_pin_clk = { RTE_USART5_SCK_PORT,  RTE_USART5_SCK_BIT,  RTE_USART5_SCK_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART5_CTS_PIN_EN == 1)
  static PINMUX_GRP_T USART5_pin_cts = { RTE_USART5_CTS_PORT,  RTE_USART5_CTS_BIT,  RTE_USART5_CTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART5_RTS_PIN_EN == 1)
  static PINMUX_GRP_T USART5_pin_rts = { RTE_USART5_RTS_PORT,  RTE_USART5_RTS_BIT,  RTE_USART5_RTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif

// DMA
#if (USART5_TX_DMA_EN != 0)
static       void      USART5_TX_DMA_Callback (int32_t event);
static const USART_DMA USART5_TX_DMA = { DMAREQ_USART5_TX, &USART5_TX_DMA_Callback, };
#endif
#if (USART5_RX_DMA_EN != 0)
static       void      USART5_RX_DMA_Callback (int32_t event);
static const USART_DMA USART5_RX_DMA = { DMAREQ_USART5_RX, &USART5_RX_DMA_Callback, };
#endif

static const USART_RESOURCES USART5_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#if (RTE_USART5_SCLK_PIN_EN == 1)
    1,  // supports Synchronous Master mode
    1,  // supports Synchronous Slave mode
#else
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
#endif
    0,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#if (RTE_USART5_RTS_PIN_EN == 1)
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#if (RTE_USART5_RTS_PIN_EN == 1)
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    0,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
#if (RTE_USART5_RTS_PIN_EN == 1)
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#if (RTE_USART5_CTS_PIN_EN == 1)
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#if (RTE_USART5_CTS_PIN_EN == 1)
    1,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0,  // Signal RI change event: \ref ARM_USART_EVENT_RI
  },
    LPC_USART5,
  {     // USART Pin Configuration
#if (RTE_USART5_TXD_PIN_EN == 1)
    &USART5_pin_tx,
#else
    NULL,
#endif
#if (RTE_USART5_RXD_PIN_EN == 1)
    &USART5_pin_rx,
#else
    NULL,
#endif
#if (RTE_USART5_SCLK_PIN_EN == 1)
    &USART5_pin_clk,
#else
    NULL,
#endif
#if (RTE_USART5_CTS_PIN_EN == 1)
    &USART5_pin_cts,
#else
    NULL,
#endif
#if (RTE_USART5_RTS_PIN_EN == 1)
    &USART5_pin_rts,
#else
    NULL,
#endif
  },
  // TX DMA
#if (USART5_TX_DMA_EN != 0)
  &USART5_TX_DMA,
#else
  NULL,
#endif

  // RX_DMA
#if (USART5_RX_DMA_EN != 0)
  &USART5_RX_DMA,
#else
  NULL,
#endif
    USART5_SYSCON_CLOCK,
    USART5_RESET,
    USART5_OVERSAMPLE,
    USART5_TX_TRIG_LEVEL,
    USART5_RX_TRIG_LEVEL,
    USART5_IRQn,
    &USART5_Info,
};
#endif

// USART6
#if (RTE_USART6)
static USART_INFO USART6_Info = { 0 };
#if (RTE_USART6_TXD_PIN_EN == 1)
  static PINMUX_GRP_T USART6_pin_tx  = { RTE_USART6_TXD_PORT,  RTE_USART6_TXD_BIT,  RTE_USART6_TXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART6_RXD_PIN_EN == 1)
  static PINMUX_GRP_T USART6_pin_rx  = { RTE_USART6_RXD_PORT,  RTE_USART6_RXD_BIT,  RTE_USART6_RXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART6_SCK_PIN_EN == 1)
  static PINMUX_GRP_T USART6_pin_clk = { RTE_USART6_SCK_PORT,  RTE_USART6_SCK_BIT,  RTE_USART6_SCK_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART6_CTS_PIN_EN == 1)
  static PINMUX_GRP_T USART6_pin_cts = { RTE_USART6_CTS_PORT,  RTE_USART6_CTS_BIT,  RTE_USART6_CTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART6_RTS_PIN_EN == 1)
  static PINMUX_GRP_T USART6_pin_rts = { RTE_USART6_RTS_PORT,  RTE_USART6_RTS_BIT,  RTE_USART6_RTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif

// DMA
#if (USART6_TX_DMA_EN != 0)
static       void      USART6_TX_DMA_Callback (int32_t event);
static const USART_DMA USART6_TX_DMA = { DMAREQ_USART6_TX, &USART6_TX_DMA_Callback, };
#endif
#if (USART6_RX_DMA_EN != 0)
static       void      USART6_RX_DMA_Callback (int32_t event);
static const USART_DMA USART6_RX_DMA = { DMAREQ_USART6_RX, &USART6_RX_DMA_Callback, };
#endif

static const USART_RESOURCES USART6_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#if (RTE_USART6_SCLK_PIN_EN == 1)
    1,  // supports Synchronous Master mode
    1,  // supports Synchronous Slave mode
#else
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
#endif
    0,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#if (RTE_USART6_RTS_PIN_EN == 1)
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#if (RTE_USART6_RTS_PIN_EN == 1)
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    0,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
#if (RTE_USART6_RTS_PIN_EN == 1)
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#if (RTE_USART6_CTS_PIN_EN == 1)
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#if (RTE_USART6_CTS_PIN_EN == 1)
    1,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0,  // Signal RI change event: \ref ARM_USART_EVENT_RI
  },
    LPC_USART6,
  {     // USART Pin Configuration
#if (RTE_USART6_TXD_PIN_EN == 1)
    &USART6_pin_tx,
#else
    NULL,
#endif
#if (RTE_USART6_RXD_PIN_EN == 1)
    &USART6_pin_rx,
#else
    NULL,
#endif
#if (RTE_USART6_SCLK_PIN_EN == 1)
    &USART6_pin_clk,
#else
    NULL,
#endif
#if (RTE_USART6_CTS_PIN_EN == 1)
    &USART6_pin_cts,
#else
    NULL,
#endif
#if (RTE_USART6_RTS_PIN_EN == 1)
    &USART6_pin_rts,
#else
    NULL,
#endif
  },
  // TX DMA
#if (USART6_TX_DMA_EN != 0)
  &USART6_TX_DMA,
#else
  NULL,
#endif

  // RX_DMA
#if (USART6_RX_DMA_EN != 0)
  &USART6_RX_DMA,
#else
  NULL,
#endif
    USART6_SYSCON_CLOCK,
    USART6_RESET,
    USART6_OVERSAMPLE,
    USART6_TX_TRIG_LEVEL,
    USART6_RX_TRIG_LEVEL,
    USART6_IRQn,
    &USART6_Info,
};
#endif

