qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/USART_LPC5411x.c
// USART7
#if (RTE_USART7)
static USART_INFO USART7_Info = { 0 };
#if (RTE_USART7_TXD_PIN_EN == 1)
  static PINMUX_GRP_T USART7_pin_tx  = { RTE_USART7_TXD_PORT,  RTE_USART7_TXD_BIT,  RTE_USART7_TXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART7_RXD_PIN_EN == 1)
  static PINMUX_GRP_T USART7_pin_rx  = { RTE_USART7_RXD_PORT,  RTE_USART7_RXD_BIT,  RTE_USART7_RXD_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART7_SCK_PIN_EN == 1)
  static PINMUX_GRP_T USART7_pin_clk = { RTE_USART7_SCK_PORT,  RTE_USART7_SCK_BIT,  RTE_USART7_SCK_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART7_CTS_PIN_EN == 1)
  static PINMUX_GRP_T USART7_pin_cts = { RTE_USART7_CTS_PORT,  RTE_USART7_CTS_BIT,  RTE_USART7_CTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif
#if (RTE_USART7_RTS_PIN_EN == 1)
  static PINMUX_GRP_T USART7_pin_rts = { RTE_USART7_RTS_PORT,  RTE_USART7_RTS_BIT,  RTE_USART7_RTS_FUNC  | IOCON_DIGITAL_EN | IOCON_INPFILT_OFF};
#endif

// DMA
#if (USART7_TX_DMA_EN != 0)
static       void      USART7_TX_DMA_Callback (int32_t event);
static const USART_DMA USART7_TX_DMA = { DMAREQ_USART7_TX, &USART7_TX_DMA_Callback, };
#endif
#if (USART7_RX_DMA_EN != 0)
static       void      USART7_RX_DMA_Callback (int32_t event);
static const USART_DMA USART7_RX_DMA = { DMAREQ_USART7_RX, &USART7_RX_DMA_Callback, };
#endif

static const USART_RESOURCES USART7_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#if (RTE_USART7_SCLK_PIN_EN == 1)
    1,  // supports Synchronous Master mode
    1,  // supports Synchronous Slave mode
#else
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
#endif
    0,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#if (RTE_USART7_RTS_PIN_EN == 1)
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#if (RTE_USART7_RTS_PIN_EN == 1)
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    0,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
#if (RTE_USART7_RTS_PIN_EN == 1)
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#if (RTE_USART7_CTS_PIN_EN == 1)
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#if (RTE_USART7_CTS_PIN_EN == 1)
    1,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0,  // Signal RI change event: \ref ARM_USART_EVENT_RI
  },
    LPC_USART7,
  {     // USART Pin Configuration
#if (RTE_USART7_TXD_PIN_EN == 1)
    &USART7_pin_tx,
#else
    NULL,
#endif
#if (RTE_USART7_RXD_PIN_EN == 1)
    &USART7_pin_rx,
#else
    NULL,
#endif
#if (RTE_USART7_SCLK_PIN_EN == 1)
    &USART7_pin_clk,
#else
    NULL,
#endif
#if (RTE_USART7_CTS_PIN_EN == 1)
    &USART7_pin_cts,
#else
    NULL,
#endif
#if (RTE_USART7_RTS_PIN_EN == 1)
    &USART7_pin_rts,
#else
    NULL,
#endif
  },
  // TX DMA
#if (USART7_TX_DMA_EN != 0)
  &USART7_TX_DMA,
#else
  NULL,
#endif

  // RX_DMA
#if (USART7_RX_DMA_EN != 0)
  &USART7_RX_DMA,
#else
  NULL,
#endif
    USART7_SYSCON_CLOCK,
    USART7_RESET,
    USART7_OVERSAMPLE,
    USART7_TX_TRIG_LEVEL,
    USART7_RX_TRIG_LEVEL,
    USART7_IRQn,
    &USART7_Info,
};
#endif

// Function Prototypes
static int32_t USART_Receive (void            *data,
                              uint32_t         num,
                              USART_RESOURCES *usart);


// USART Driver functions

/**
  \fn          ARM_DRIVER_VERSION USARTx_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION USARTx_GetVersion (void) {
  return usart_driver_version;
}

/**
  \fn          ARM_USART_CAPABILITIES USART_GetCapabilities (USART_RESOURCES *usart)
  \brief       Get driver capabilities
  \param[in]   usart     Pointer to USART resources
  \return      \ref ARM_USART_CAPABILITIES
*/
static ARM_USART_CAPABILITIES USART_GetCapabilities (USART_RESOURCES *usart) {
  return usart->capabilities;
}

/**
  \fn          int32_t USART_Initialize (ARM_USART_SignalEvent_t  cb_event
                                         USART_RESOURCES         *usart)
  \brief       Initialize USART Interface.
  \param[in]   cb_event  Pointer to \ref ARM_USART_SignalEvent
  \param[in]   usart     Pointer to USART resources
  \return      \ref execution_status
*/
static int32_t USART_Initialize (ARM_USART_SignalEvent_t  cb_event,
                                 USART_RESOURCES         *usart) {

  if (usart->info->flags & USART_FLAG_INITIALIZED) {
    // Driver is already initialized
    return ARM_DRIVER_OK;
  }

  // Initialize USART Run-time Resources
  usart->info->cb_event = cb_event;

  usart->info->status.rx_busy          = 0U;
  usart->info->status.rx_overflow      = 0U;
  usart->info->status.rx_break         = 0U;
  usart->info->status.rx_framing_error = 0U;
  usart->info->status.rx_parity_error  = 0U;
  usart->info->status.tx_underflow     = 0U;

  usart->info->xfer.send_active        = 0U;
  usart->info->xfer.tx_def_val         = 0U;

  Chip_Clock_EnablePeriphClock(SYSCON_CLOCK_IOCON);

  // Configure TX pin
  if (usart->pins.txd != NULL) {
    Chip_IOCON_PinMuxSet(LPC_IOCON, usart->pins.txd->port, usart->pins.txd->pin, usart->pins.txd->modefunc);
  }

  // Configure RX pin
  if (usart->pins.rxd != NULL) {
    Chip_IOCON_PinMuxSet(LPC_IOCON, usart->pins.rxd->port, usart->pins.rxd->pin, usart->pins.rxd->modefunc);
  }

