qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/USART_LPC5411x.c
  // Configure CTS pin
  if (usart->capabilities.cts) {
    Chip_IOCON_PinMuxSet(LPC_IOCON, usart->pins.cts->port, usart->pins.cts->pin, usart->pins.cts->modefunc);
  }

  Chip_Clock_EnablePeriphClock(SYSCON_CLOCK_GPIO0);
  Chip_Clock_EnablePeriphClock(SYSCON_CLOCK_GPIO1);

  if (usart->capabilities.rts) {
    Chip_GPIO_SetPinDIROutput(LPC_GPIO, usart->pins.cts->port, usart->pins.cts->pin);
  }

  usart->info->flags = USART_FLAG_INITIALIZED;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USART_Uninitialize (USART_RESOURCES *usart)
  \brief       De-initialize USART Interface.
  \param[in]   usart     Pointer to USART resources
  \return      \ref execution_status
*/
static int32_t USART_Uninitialize (USART_RESOURCES *usart) {

  // Reset TX pin configuration
  if (usart->pins.txd) {
    Chip_IOCON_PinMuxSet(LPC_IOCON, usart->pins.txd->port, usart->pins.txd->pin, 0U);
  }

  // Reset RX pin configuration
  if (usart->pins.rxd) {
    Chip_IOCON_PinMuxSet(LPC_IOCON, usart->pins.rxd->port, usart->pins.rxd->pin, 0U);
  }

  // Reset CLK pin configuration
  if (usart->pins.sclk) {
    Chip_IOCON_PinMuxSet(LPC_IOCON, usart->pins.sclk->port, usart->pins.sclk->pin, 0U);
  }

  // Reset CTS pin configuration
  if (usart->capabilities.cts) {
    Chip_IOCON_PinMuxSet(LPC_IOCON, usart->pins.cts->port, usart->pins.cts->pin, 0U);
  }

  // Reset RTS pin configuration
  if (usart->capabilities.rts) {
    Chip_GPIO_SetPinDIRInput(LPC_GPIO, usart->pins.cts->port, usart->pins.cts->pin);
    Chip_IOCON_PinMuxSet(LPC_IOCON, usart->pins.rts->port, usart->pins.rts->pin, 0U);
  }

  // Reset USART status flags
  usart->info->flags = 0U;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USART_PowerControl (ARM_POWER_STATE state)
  \brief       Control USART Interface Power.
  \param[in]   state  Power state
  \param[in]   usart  Pointer to USART resources
  \return      \ref execution_status
*/
static int32_t USART_PowerControl (ARM_POWER_STATE  state,
                                   USART_RESOURCES *usart) {

#if USART_DMA_USED
  DMA_PERIPHERAL_CONTEXT_T dma_context;
#endif

  switch (state) {
    case ARM_POWER_OFF:
      // Disable USART IRQ
      NVIC_DisableIRQ(usart->irq_num);

      // Disable USART
      Chip_UART_Disable (usart->reg);

      // Reset USART peripheral
      Chip_SYSCON_PeriphReset (usart->reset_msk);

      // De-initialize USART peripheral
      Chip_UART_DeInit (usart->reg);

      // Clear pending USART interrupts in NVIC
      NVIC_ClearPendingIRQ(usart->irq_num);

      // Clear driver variables
      usart->info->status.rx_busy          = 0U;
      usart->info->status.rx_overflow      = 0U;
      usart->info->status.rx_break         = 0U;
      usart->info->status.rx_framing_error = 0U;
      usart->info->status.rx_parity_error  = 0U;
      usart->info->status.tx_underflow     = 0U;
      usart->info->xfer.send_active        = 0U;

      usart->info->flags &= ~USART_FLAG_POWERED;
      break;

    case ARM_POWER_LOW:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    case ARM_POWER_FULL:
      if ((usart->info->flags & USART_FLAG_INITIALIZED) == 0U) { return ARM_DRIVER_ERROR; }
      if ((usart->info->flags & USART_FLAG_POWERED)     != 0U) { return ARM_DRIVER_OK; }

      // USART peripheral initialize
      Chip_UART_Init (usart->reg);

      // Disable transmitter
      Chip_UART_TXDisable (usart->reg);


      // Disable interrupts
      Chip_UART_IntDisable (usart->reg, UART_INT_TXIDLE     |
                                        UART_INT_DELTACTS   |
                                        UART_INT_TXDIS      |
                                        UART_INT_DELTARXBRK |
                                        UART_INT_START      |
                                        UART_INT_FRAMERR    |
                                        UART_INT_PARITYERR  |
                                        UART_INT_RXNOISE    |
                                        UART_INT_ABERR      );

      // Flush FIFOs
      Chip_UART_FlushFIFOs (usart->reg);

      // Disable FIFO Interrupts
      Chip_UART_DisableFIFOInts (usart->reg, UART_FIFOINT_BITMASK);

      // Clear driver variables
      usart->info->status.rx_busy             = 0U;
      usart->info->status.rx_overflow         = 0U;
      usart->info->status.rx_break            = 0U;
      usart->info->status.rx_framing_error    = 0U;
      usart->info->status.rx_parity_error     = 0U;
      usart->info->status.tx_underflow        = 0U;

      usart->info->mode                       = 0U;
      usart->info->flags                      = 0U;
      usart->info->xfer.send_active           = 0U;
      usart->info->xfer.receiver_enabled      = 0U;

      // Set USART FIFO trigger level
      Chip_UART_SetFIFOTrigLevel (usart->reg, usart->txlvl, usart->rxlvl);

      // Enable CTS interrupt
      if (usart->capabilities.cts) {
          Chip_UART_IntEnable (usart->reg, UART_INT_DELTACTS);
      }

      // DMA Initialization
#if USART_DMA_USED
      if ((usart->dma_tx != NULL) || (usart->dma_rx != NULL) ) {
        Chip_DMA_Init(LPC_DMA);
        Chip_DMA_Enable(LPC_DMA);
        Chip_DMA_SetSRAMBase(LPC_DMA, DMA_ADDR(Chip_DMA_Table));

        // Register DMA callback
#if USART_TX_DMA_USED
        if (usart->dma_tx != NULL) {
          dma_context.channel = usart->dma_tx->chid;
          Chip_DMASERVICE_RegisterCb (&dma_context, usart->dma_tx->callback);
        }
#endif
#if USART_RX_DMA_USED
        if (usart->dma_rx != NULL) {
          dma_context.channel = usart->dma_rx->chid;
          Chip_DMASERVICE_RegisterCb (&dma_context, usart->dma_rx->callback);
        }
#endif

        // Enable DMA IRQ
        NVIC_EnableIRQ(DMA_IRQn);

        Chip_UART_ConfigDMA(usart->reg);
      }
#endif

      // Enable USART
      Chip_UART_Enable (usart->reg);

      usart->info->flags = USART_FLAG_POWERED | USART_FLAG_INITIALIZED;

      // Clear and Enable USART IRQ
      NVIC_ClearPendingIRQ(usart->irq_num);
      NVIC_EnableIRQ(usart->irq_num);

      break;

    default: return ARM_DRIVER_ERROR_UNSUPPORTED;
  }
  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USART_Send (const void            *data,
                                         uint32_t         num,
                                         USART_RESOURCES *usart)
  \brief       Start sending data to USART transmitter.
  \param[in]   data  Pointer to buffer with data to send to USART transmitter
  \param[in]   num   Number of data items to send
  \param[in]   usart Pointer to USART resources
  \return      \ref execution_status
*/
static int32_t USART_Send (const void            *data,
                                 uint32_t         num,
                                 USART_RESOURCES *usart) {
  int32_t stat;
#if USART_TX_DMA_USED
  DMA_PERIPHERAL_CONTEXT_T dma_context;
#endif

