qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/USART_LPC5411x.c
  if ((data == NULL) || (num == 0U)) {
    // Invalid parameters
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if ((usart->info->flags & USART_FLAG_CONFIGURED) == 0U) {
    // USART is not configured (mode not selected)
    return ARM_DRIVER_ERROR;
  }

  if (usart->info->xfer.send_active != 0U) {
    // Send is not completed yet
    return ARM_DRIVER_ERROR_BUSY;
  }

  // Set Send active flag
  usart->info->xfer.send_active = 1U;

  // Clear TX status
  usart->info->status.tx_underflow = 0U;

#if USART_TX_DMA_USED
  usart->info->xfer.tx_src_inc = DMA_XFERCFG_SRCINC_1;
#endif

  // Synchronous mode
  if ((usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
      (usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE )) {
    if (usart->info->xfer.sync_mode == 0U) {
      usart->info->xfer.sync_mode = USART_SYNC_MODE_TX;
      // Start dummy reads
      stat = USART_Receive (&usart->info->xfer.rx_dump_val, num, usart);
      if (stat != ARM_DRIVER_OK) { return ARM_DRIVER_ERROR; }
    }
#if USART_TX_DMA_USED
    else {
      if (usart->info->xfer.sync_mode == USART_SYNC_MODE_RX) {
        // Dummy DMA writes (do not increment source address)
        usart->info->xfer.tx_src_inc = DMA_XFERCFG_SRCINC_0;
      }
    }
#endif
  }

  // Save transmit buffer info
  usart->info->xfer.tx_buf = (uint8_t *)data;
  usart->info->xfer.tx_num = num;
  usart->info->xfer.tx_cnt = 0U;

#if USART_TX_DMA_USED
  // DMA Mode
  if (usart->dma_tx != NULL) {
    if (num > 1024U) { num = 1024U; }

    if (usart->info->xfer.tx_src_inc == DMA_XFERCFG_SRCINC_1) {
      usart->info->xfer.tx_buf      += num;
    }
    usart->info->xfer.tx_num_pending = num;

    dma_context.width = DMA_XFERCFG_WIDTH_8;
    if (usart->reg->CFG & UART_CFG_DATALEN_9) {
      // 9-bit data
      dma_context.width = DMA_XFERCFG_WIDTH_16;
      if (usart->info->xfer.tx_src_inc == DMA_XFERCFG_SRCINC_1) {
        usart->info->xfer.tx_buf += num;
      }
      num *= 2;
    }
    dma_context.channel           = usart->dma_tx->chid;
    dma_context.register_location = &(usart->reg->FIFOWR);
    dma_context.dst_increment     = DMA_XFERCFG_DSTINC_0;
    dma_context.src_increment     = usart->info->xfer.tx_src_inc;
    dma_context.write             = 1U;

    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)data, num);
  } else
#endif
  {

    // Interrupt mode
    // Enable TX FIFO level interrupt
    Chip_UART_EnableFIFOInts (usart->reg, UART_FIFOINT_TXLVL);
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USART_Receive (void            *data,
                                      uint32_t         num,
                                      USART_RESOURCES *usart)
  \brief       Start receiving data from USART receiver.
  \param[out]  data  Pointer to buffer for data to receive from USART receiver
  \param[in]   num   Number of data items to receive
  \param[in]   usart Pointer to USART resources
  \return      \ref execution_status
*/
static int32_t USART_Receive (void            *data,
                              uint32_t         num,
                              USART_RESOURCES *usart) {

  int32_t stat;
#if USART_RX_DMA_USED
  DMA_PERIPHERAL_CONTEXT_T dma_context;
#endif

  if ((data == NULL) || (num == 0U)) {
    // Invalid parameters
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if ((usart->info->flags & USART_FLAG_CONFIGURED) == 0U) {
    // USART is not configured (mode not selected)
    return ARM_DRIVER_ERROR;
  }

  // Check if receiver is busy
  if (usart->info->status.rx_busy == 1U) {
    return ARM_DRIVER_ERROR_BUSY;
  }

  // Set RX busy flag
  usart->info->status.rx_busy = 1U;

  // Save number of data to be received
  usart->info->xfer.rx_num = num;

  // Clear RX statuses
  usart->info->status.rx_break          = 0U;
  usart->info->status.rx_framing_error  = 0U;
  usart->info->status.rx_overflow       = 0U;
  usart->info->status.rx_parity_error   = 0U;

  // Save receive buffer info
  usart->info->xfer.rx_buf = (uint8_t *)data;
  usart->info->xfer.rx_cnt =  0U;

#if USART_RX_DMA_USED
  usart->info->xfer.rx_dest_inc = DMA_XFERCFG_DSTINC_1;

  // Synchronous mode
  if ((usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
      (usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE )) {
    if (usart->info->xfer.sync_mode == USART_SYNC_MODE_TX) {
      // Dummy DMA reads (do not increment destination address)
      usart->info->xfer.rx_dest_inc = DMA_XFERCFG_DSTINC_0;
    }
  }

  // DMA Mode
  if (usart->dma_rx != NULL) {
    if (num > 1024U) { num = 1024U; }

    if (usart->info->xfer.rx_dest_inc == DMA_XFERCFG_DSTINC_1) {
      usart->info->xfer.rx_buf      += num;
    }
    usart->info->xfer.rx_num_pending = num;

    dma_context.width = DMA_XFERCFG_WIDTH_8;
    if (usart->reg->CFG & UART_CFG_DATALEN_9) {
      // 9-bit data
      dma_context.width = DMA_XFERCFG_WIDTH_16;
      if (usart->info->xfer.rx_dest_inc == DMA_XFERCFG_DSTINC_1) {
        usart->info->xfer.rx_buf += num;
      }
      num *= 2;
    }                         
    dma_context.channel           = usart->dma_rx->chid;
    dma_context.register_location = (volatile uint32_t *)(&usart->reg->FIFORD);
    dma_context.dst_increment     = usart->info->xfer.rx_dest_inc;
    dma_context.src_increment     = DMA_XFERCFG_SRCINC_0;
    dma_context.write             = 0U;

    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)data, num);
  } else
#endif
  {

    // Interrupt mode
    if (usart->info->xfer.receiver_enabled != 0U) {
      // Enable RX FIFO level interrupt
      Chip_UART_EnableFIFOInts (usart->reg, UART_FIFOINT_RXLVL);
    }
  }

  // Synchronous mode
  if ((usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
      (usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE )) {
    if (usart->info->xfer.sync_mode == 0U) {
      usart->info->xfer.sync_mode = USART_SYNC_MODE_RX;
      // Send dummy data
      stat = USART_Send (&usart->info->xfer.tx_def_val, num, usart);
      if (stat != ARM_DRIVER_OK) { return ARM_DRIVER_ERROR; }
    }
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USART_Transfer (const void             *data_out,
                                             void             *data_in,
                                             uint32_t          num,
                                             USART_RESOURCES  *usart)
  \brief       Start sending/receiving data to/from USART transmitter/receiver.
  \param[in]   data_out  Pointer to buffer with data to send to USART transmitter
  \param[out]  data_in   Pointer to buffer for data to receive from USART receiver
  \param[in]   num       Number of data items to transfer
  \param[in]   usart     Pointer to USART resources
  \return      \ref execution_status
*/
static int32_t USART_Transfer (const void             *data_out,
                                     void             *data_in,
                                     uint32_t          num,
                                     USART_RESOURCES  *usart) {
  int32_t status;

  if ((data_out == NULL) || (data_in == NULL) || (num == 0U)) {
    // Invalid parameters
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if ((usart->info->flags & USART_FLAG_CONFIGURED) == 0U) {
    // USART is not configured
    return ARM_DRIVER_ERROR;
  }

  if ((usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
      (usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE )) {

    // Set xfer mode
    usart->info->xfer.sync_mode = USART_SYNC_MODE_TX_RX;

