qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/USART_LPC5411x.c
    // Receive
    status = USART_Receive (data_in, num, usart);
    if (status != ARM_DRIVER_OK) { return status; }

    // Send
    status = USART_Send (data_out, num, usart);
    if (status != ARM_DRIVER_OK) { return status; }

  } else {
    // Only in synchronous mode
    return ARM_DRIVER_ERROR;
  }
  return ARM_DRIVER_OK;
}

/**
  \fn          uint32_t USART_GetTxCount (USART_RESOURCES *usart)
  \brief       Get transmitted data count.
  \param[in]   usart     Pointer to USART resources
  \return      number of data items transmitted
*/
static uint32_t USART_GetTxCount (USART_RESOURCES *usart) {
  volatile uint32_t cnt;

#if USART_TX_DMA_USED
  if (usart->dma_tx != NULL) {
    do {
      // Clear DMA interrupt flag
      usart->info->xfer.tx_dma_int_flag = 0U;


      cnt  = usart->info->xfer.tx_cnt + usart->info->xfer.tx_num_pending;
      cnt -= ((LPC_DMA->DMACH[usart->dma_tx->chid].XFERCFG >> 16U) & 0x3FF) + 1U;
    } while (usart->info->xfer.tx_dma_int_flag != 0U);
  } else
#endif
  {
    cnt = usart->info->xfer.tx_cnt;
  }

  return cnt;
}

/**
  \fn          uint32_t USART_GetRxCount (USART_RESOURCES *usart)
  \brief       Get received data count.
  \param[in]   usart     Pointer to USART resources
  \return      number of data items received
*/
static uint32_t USART_GetRxCount (USART_RESOURCES *usart) {
  volatile uint32_t cnt;

#if USART_RX_DMA_USED
  if (usart->dma_rx != NULL) {
    do {
      // Clear DMA interrupt flag
      usart->info->xfer.rx_dma_int_flag = 0U;


      cnt  = usart->info->xfer.rx_cnt + usart->info->xfer.rx_num_pending;
      cnt -= ((LPC_DMA->DMACH[usart->dma_rx->chid].XFERCFG >> 16U) & 0x3FF) + 1U;
    } while (usart->info->xfer.rx_dma_int_flag != 0U);
  } else
#endif
  {
    cnt = usart->info->xfer.rx_cnt;
  }

  return cnt;
}

/**
  \fn          int32_t USART_Control (uint32_t          control,
                                      uint32_t          arg,
                                      USART_RESOURCES  *usart)
  \brief       Control USART Interface.
  \param[in]   control  Operation
  \param[in]   arg      Argument of operation (optional)
  \param[in]   usart    Pointer to USART resources
  \return      common \ref execution_status and driver specific \ref usart_execution_status
*/
static int32_t USART_Control (uint32_t          control,
                              uint32_t          arg,
                              USART_RESOURCES  *usart) {
#if (USARTx_FRGCTRL_MUL != 256)
  uint64_t div64;
  uint32_t div;
#endif
  uint32_t i, val, mode;
  uint32_t cfg;

  if ((usart->info->flags & USART_FLAG_POWERED) == 0U) {
    // USART not powered
    return ARM_DRIVER_ERROR;
  }

  cfg = 0U;

  switch (control & ARM_USART_CONTROL_Msk) {
    // Control TX
    case ARM_USART_CONTROL_TX:
      // Check if TX line available
      if (usart->pins.txd == NULL) { return ARM_DRIVER_ERROR; }
      if (arg) {

#if USART_TX_DMA_USED
        // Enable DMA Channel
        if (usart->dma_tx != NULL) {
          Chip_DMA_EnableChannel(LPC_DMA, usart->dma_tx->chid);
          Chip_DMA_EnableIntChannel(LPC_DMA, usart->dma_tx->chid);
          Chip_DMA_SetupChannelConfig(LPC_DMA, usart->dma_tx->chid,(DMA_CFG_PERIPHREQEN | DMA_CFG_TRIGTYPE_EDGE | DMA_CFG_TRIGPOL_HIGH | DMA_CFG_BURSTPOWER_8 | DMA_CFG_CHPRIORITY(0)));
        }
#endif

        // Enable TX FIFO error interrupt
        Chip_UART_EnableFIFOInts  (usart->reg, UART_FIFOINT_TXERR);

        // Transmitter enable
        Chip_UART_TXEnable (usart->reg);

      } else {

        // Disable TX FIFO error interrupt
        Chip_UART_DisableFIFOInts  (usart->reg, UART_FIFOINT_TXERR);

        // Transmitter disable
        Chip_UART_TXDisable (usart->reg);

#if USART_TX_DMA_USED
        // Disable DMA Channel
        if (usart->dma_tx != NULL) {
          Chip_DMA_DisableIntChannel(LPC_DMA, usart->dma_tx->chid);
          Chip_DMA_DisableChannel(LPC_DMA, usart->dma_tx->chid);
        }
#endif
      }
      return ARM_DRIVER_OK;

    // Control RX
    case ARM_USART_CONTROL_RX:
      if (usart->pins.rxd == NULL) { return ARM_DRIVER_ERROR; }
      if (arg) {
        usart->info->xfer.receiver_enabled = 1U;

        // Enable RX interrupts (framing, parity error, break)
        val = UART_INT_FRAMERR | UART_INT_PARITYERR | UART_INT_DELTARXBRK;
        Chip_UART_IntEnable (usart->reg, val);

        // Enable RX FIFO Error interrupt
        val = UART_FIFOINT_RXERR;

#if USART_RX_DMA_USED
        // Enable DMA Channel
        if (usart->dma_rx != NULL) {
          Chip_DMA_EnableIntChannel(LPC_DMA, usart->dma_rx->chid);
          Chip_DMA_EnableChannel(LPC_DMA, usart->dma_rx->chid);
          Chip_DMA_SetupChannelConfig(LPC_DMA, usart->dma_rx->chid,(DMA_CFG_PERIPHREQEN | DMA_CFG_TRIGTYPE_EDGE | DMA_CFG_TRIGPOL_HIGH | DMA_CFG_BURSTPOWER_8 | DMA_CFG_CHPRIORITY(0)));
        } else
#endif
        {
          if (usart->info->status.rx_busy != 0U) {
            // Enable RX FIFO level interrupt
            val |= UART_FIFOINT_RXLVL;
          }
        }
        Chip_UART_EnableFIFOInts (usart->reg, val);

      } else {
        // Disable RX interrupts (framing, parity error, break)
        val = UART_INT_FRAMERR | UART_INT_PARITYERR | UART_INT_DELTARXBRK;
        Chip_UART_IntDisable (usart->reg, val);

#if USART_RX_DMA_USED
        // Disable DMA Channel
        if (usart->dma_rx != NULL) {
          Chip_DMA_DisableIntChannel(LPC_DMA, usart->dma_rx->chid);
          Chip_DMA_DisableChannel(LPC_DMA, usart->dma_rx->chid);
        }
#endif

        // Disable RX FIFO error and RX FIFO level interrupts
        val = UART_FIFOINT_RXERR | UART_FIFOINT_RXLVL;
        Chip_UART_DisableFIFOInts (usart->reg, val);

        usart->info->xfer.receiver_enabled = 0U;
      }
      return ARM_DRIVER_OK;

    // Control break
    case ARM_USART_CONTROL_BREAK:
      if (arg) {
        if (usart->info->xfer.send_active != 0U) { return ARM_DRIVER_ERROR_BUSY; }

        // Set Send active flag
        usart->info->xfer.send_active = 1U;

        // Continuous break enable
        usart->reg->CTL |= UART_CTRL_TXBRKEN;
      } else {
        // Continuous break disable
        usart->reg->CTL &= ~UART_CTRL_TXBRKEN;

