qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/USART_LPC5411x.c
        // Clear Send active flag
        usart->info->xfer.send_active = 0U;
      }
      return ARM_DRIVER_OK;

    // Abort Send
    case ARM_USART_ABORT_SEND:
#if USART_TX_DMA_USED
      // Disable DMA Channel
      if (usart->dma_tx != NULL) {
        Chip_DMA_AbortChannel (LPC_DMA, usart->dma_tx->chid);
      }
#endif

      // Disable TX FIFO level interrupt
      Chip_UART_DisableFIFOInts (usart->reg, UART_FIFOINT_TXLVL);

      // Flush TX FIFO
      usart->reg->FIFOCFG |= UART_FIFOCFG_EMPTYTX;

      // Clear Send active flag
      usart->info->xfer.send_active = 0U;
      return ARM_DRIVER_OK;

    // Abort receive
    case ARM_USART_ABORT_RECEIVE:
#if USART_RX_DMA_USED
      // Disable DMA Channel
      if (usart->dma_rx != NULL) {
        Chip_DMA_AbortChannel(LPC_DMA, usart->dma_rx->chid);
      }
#endif

      // Disable RX FIFO level interrupt
      Chip_UART_DisableFIFOInts (usart->reg, UART_FIFOINT_RXLVL);

      // Flush RX FIFO
      usart->reg->FIFOCFG |= UART_FIFOCFG_EMPTYRX;

      // Clear RX busy status
      usart->info->status.rx_busy = 0U;
      return ARM_DRIVER_OK;

    // Abort transfer
    case ARM_USART_ABORT_TRANSFER:
#if USART_TX_DMA_USED
	  // Disable DMA Channel
      if (usart->dma_tx != NULL) {
        Chip_DMA_AbortChannel(LPC_DMA, usart->dma_tx->chid);
      }
#endif
#if USART_RX_DMA_USED
      if (usart->dma_rx != NULL) {
        Chip_DMA_AbortChannel(LPC_DMA, usart->dma_rx->chid);
      }
#endif
      // Disable TX and RX FIFO level interrupt
      Chip_UART_DisableFIFOInts (usart->reg, UART_FIFOINT_TXLVL | UART_FIFOINT_RXLVL);

      // Flush TX and RX FIFOs
      usart->reg->FIFOCFG |= UART_FIFOCFG_EMPTYTX | UART_FIFOCFG_EMPTYRX;

      // Clear busy statuses
      usart->info->status.rx_busy = 0U;
      usart->info->xfer.send_active  = 0U;
      return ARM_DRIVER_OK;

    default: break;
  }

  switch (control & ARM_USART_CONTROL_Msk) {
    case ARM_USART_MODE_ASYNCHRONOUS:
      mode = ARM_USART_MODE_ASYNCHRONOUS;
      break;
    case ARM_USART_MODE_SYNCHRONOUS_MASTER:
      // Enable synchronous master mode
      cfg |= UART_CFG_SYNCEN  | UART_CFG_SYNCMST;
      mode = ARM_USART_MODE_SYNCHRONOUS_MASTER;
      break;
    case ARM_USART_MODE_SYNCHRONOUS_SLAVE:
      // Enable synchronous slave mode
      cfg |= UART_CFG_SYNCEN;
      mode = ARM_USART_MODE_SYNCHRONOUS_SLAVE;
      break;
    case ARM_USART_MODE_SINGLE_WIRE:
      // Single wire mode not supported
      return ARM_USART_ERROR_MODE;
    case ARM_USART_MODE_IRDA:
      // Enable IrDA mode
      cfg |= UART_CFG_IRDA_MODE;
      mode = ARM_USART_MODE_IRDA;
      break;
    case ARM_USART_MODE_SMART_CARD:
      // Smart card mode not supported
      return ARM_USART_ERROR_MODE;

    // Default TX value
    case ARM_USART_SET_DEFAULT_TX_VALUE:
      usart->info->xfer.tx_def_val = arg;
      return ARM_DRIVER_OK;

    // IrDA pulse
    case ARM_USART_SET_IRDA_PULSE:
      if (arg != 0U) {
        return ARM_DRIVER_ERROR;
      }
      return ARM_DRIVER_OK;

    case ARM_USART_SET_SMART_CARD_GUARD_TIME:
    case ARM_USART_SET_SMART_CARD_CLOCK:
    case ARM_USART_CONTROL_SMART_CARD_NACK:
    default: return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  // Check if Receiver/Transmitter is busy
  if ( usart->info->status.rx_busy ||
      (usart->info->xfer.send_active != 0U)) {
    return ARM_DRIVER_ERROR_BUSY;
  }

  // USART Data bits
  val = (500000U * 16U) / arg;
  for (i=0U; i < 16U; i++) {
    if (((val >> i) & 0xFFFFFFF0U) == 0U) {
      if ((val >> i) < 2U) { val = 2U; }
      else                 { val = val >> i; }
      break;
    }
  }

  switch (control & ARM_USART_DATA_BITS_Msk) {
    case ARM_USART_DATA_BITS_7: cfg |= UART_CFG_DATALEN_7; break;
    case ARM_USART_DATA_BITS_8: cfg |= UART_CFG_DATALEN_8; break;
    case ARM_USART_DATA_BITS_9: cfg |= UART_CFG_DATALEN_9; break;
    default: return ARM_USART_ERROR_DATA_BITS;
  }

  // USART Parity
  switch (control & ARM_USART_PARITY_Msk) {
    case ARM_USART_PARITY_NONE: cfg |= UART_CFG_PARITY_NONE; break;
    case ARM_USART_PARITY_EVEN: cfg |= UART_CFG_PARITY_EVEN; break;
    case ARM_USART_PARITY_ODD:  cfg |= UART_CFG_PARITY_ODD;  break;
    default: return (ARM_USART_ERROR_PARITY);
  }

  // USART Stop bits
  switch (control & ARM_USART_STOP_BITS_Msk) {
    case ARM_USART_STOP_BITS_1: cfg |= UART_CFG_STOPLEN_1; break;
    case ARM_USART_STOP_BITS_2: cfg |= UART_CFG_STOPLEN_2; break;
    default: return ARM_USART_ERROR_STOP_BITS;
  }

  // USART Flow control
  switch (control & ARM_USART_FLOW_CONTROL_Msk) {
    case ARM_USART_FLOW_CONTROL_NONE:
      if (usart->pins.rts != NULL) {
        Chip_IOCON_PinMuxSet(LPC_IOCON, usart->pins.rts->port, usart->pins.rts->pin, 0U);
      }
      break;
    case ARM_USART_FLOW_CONTROL_RTS:
      if (usart->capabilities.flow_control_rts) {
        // Configure RTS pin
        Chip_IOCON_PinMuxSet(LPC_IOCON, usart->pins.rts->port, usart->pins.rts->pin, usart->pins.rts->modefunc);
        return ARM_USART_ERROR_FLOW_CONTROL;
      }
      break;
    case ARM_USART_FLOW_CONTROL_CTS:
      if (usart->capabilities.flow_control_cts) {
        // Reset RTS pin configuration
        if (usart->capabilities.rts) {
          Chip_IOCON_PinMuxSet(LPC_IOCON, usart->pins.rts->port, usart->pins.rts->pin, 0U);
        }
        cfg |= UART_CFG_CTSEN;
      } else {
        return ARM_USART_ERROR_FLOW_CONTROL;
      }
      break;
    case ARM_USART_FLOW_CONTROL_RTS_CTS:
      if (usart->capabilities.flow_control_rts &&
          usart->capabilities.flow_control_cts) {
        // Configure USART RTS alternate function
        Chip_IOCON_PinMuxSet(LPC_IOCON, usart->pins.rts->port, usart->pins.rts->pin, usart->pins.rts->modefunc);
        cfg |= UART_CFG_CTSEN;
      } else {
        return ARM_USART_ERROR_FLOW_CONTROL;
      }
    break;
    default: { return ARM_USART_ERROR_FLOW_CONTROL; }
  }

  // Clock setting for synchronous mode
  if ((mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
      (mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE )) {

