qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/USART_LPC5411x.c
    switch (control & ARM_USART_CPOL_Msk) {
      case ARM_USART_CPOL0:
        cfg |= UART_CFG_CLKPOL;
        break;
      case ARM_USART_CPOL1:
        break;
      default: return ARM_USART_ERROR_CPOL;
    }

    // USART clock phase
    if ((control & ARM_USART_CPHA_Msk) != ARM_USART_CPHA1) {
      return ARM_USART_ERROR_CPHA;
    }
  }

  // USART Baudrate
#if (USARTx_FRGCTRL_MUL != 256U)
  div64  = Chip_Clock_GetAsyncSyscon_ClockRate() << 24;
  div64 /= (usart->oversample * arg * (256U * USARTx_FRGCTRL_MUL));
  if (div64 > 0xFFFFFFFFU) { return ARM_USART_ERROR_BAUDRATE; }

  div = div64 >> 16U;
  if (div64 > 0x10000U) {
    // Round up
    div++;
  }
  LPC_ASYNC_SYSCON->FRGCTRL = ((USARTx_FRGCTRL_MUL & 0xFFU) << 8) | 0xFFU;
  Chip_UART_Div (usart->reg, div, usart->oversample);
#else
  Chip_UART_SetBaud (usart->reg, arg);
#endif

  // Configuration is OK - Mode is valid
  usart->info->mode = mode;

  // Configure CLK pin regarding mode
  if (usart->pins.sclk) {
    switch (usart->info->mode) {
      case ARM_USART_MODE_SYNCHRONOUS_MASTER:
      case ARM_USART_MODE_SYNCHRONOUS_SLAVE:
        // Pin function = USART UCLK (input)
        Chip_IOCON_PinMuxSet(LPC_IOCON, usart->pins.sclk->port, usart->pins.sclk->pin, usart->pins.sclk->modefunc);
        break;
      default:
        // Pin function = GPIO
        Chip_IOCON_PinMuxSet(LPC_IOCON, usart->pins.sclk->port, usart->pins.sclk->pin, 0U);
    }
  }

  // Set Configuration register
  usart->reg->CFG = cfg | UART_CFG_ENABLE;

  // Set configured flag
  usart->info->flags |= USART_FLAG_CONFIGURED;

  return ARM_DRIVER_OK;
}

/**
  \fn          ARM_USART_STATUS USART_GetStatus (USART_RESOURCES *usart)
  \brief       Get USART status.
  \param[in]   usart     Pointer to USART resources
  \return      USART status \ref ARM_USART_STATUS
*/
static ARM_USART_STATUS USART_GetStatus (USART_RESOURCES *usart) {
  ARM_USART_STATUS stat;

  stat.tx_busy          = (Chip_UART_GetStatus (usart->reg) & UART_STAT_TXIDLE ? (0U) : (1U));
  stat.rx_busy          = usart->info->status.rx_busy;
  stat.tx_underflow     = usart->info->status.tx_underflow;
  stat.rx_overflow      = usart->info->status.rx_overflow;
  stat.rx_break         = usart->info->status.rx_break;
  stat.rx_framing_error = usart->info->status.rx_framing_error;
  stat.rx_parity_error  = usart->info->status.rx_parity_error;
  return stat;
}

/**
  \fn          int32_t USART_SetModemControl (ARM_USART_MODEM_CONTROL  control,
                                              USART_RESOURCES         *usart)
  \brief       Set USART Modem Control line state.
  \param[in]   control   \ref ARM_USART_MODEM_CONTROL
  \param[in]   usart     Pointer to USART resources
  \return      \ref execution_status
*/
static int32_t USART_SetModemControl (ARM_USART_MODEM_CONTROL  control,
                                      USART_RESOURCES         *usart) {

  if ((usart->info->flags & USART_FLAG_CONFIGURED) == 0U) {
    // USART is not configured
    return ARM_DRIVER_ERROR;
  }

  if (usart->capabilities.rts) {
    if (control == ARM_USART_RTS_CLEAR) {
      Chip_GPIO_SetPinOutLow (LPC_GPIO, usart->pins.rts->port, (1U << usart->pins.rts->pin));
    }
    if (control == ARM_USART_RTS_SET) {
      Chip_GPIO_SetPinOutHigh (LPC_GPIO, usart->pins.rts->port, (1U << usart->pins.rts->pin));
    }
  } else {
    return ARM_DRIVER_ERROR_UNSUPPORTED;
  }
  return ARM_DRIVER_OK;
}

/**
  \fn          ARM_USART_MODEM_STATUS USART_GetModemStatus (USART_RESOURCES *usart)
  \brief       Get USART Modem Status lines state.
  \param[in]   usart     Pointer to USART resources
  \return      modem status \ref ARM_USART_MODEM_STATUS
*/
static ARM_USART_MODEM_STATUS USART_GetModemStatus (USART_RESOURCES *usart) {
  ARM_USART_MODEM_STATUS modem_status;

  modem_status.cts = 0U;
  modem_status.dsr = 0U;
  modem_status.ri  = 0U;
  modem_status.dcd = 0U;

  if ((usart->info->flags & USART_FLAG_CONFIGURED) != 0U) {
    if (Chip_UART_GetStatus (usart->reg) & UART_STAT_CTS) {
      modem_status.cts = 1U;
    }
  }

  return modem_status;
}

/**
  \fn          void USART_IRQHandler (USART_RESOURCES *usart)
  \brief       USART Interrupt handler.
  \param[in]   usart     Pointer to USART resources
*/
static void USART_IRQHandler (USART_RESOURCES *usart) {
  uint32_t cnt, val, event, usart_int_stat, fifo_int_stat;
  uint16_t data;

  // Get Interrupt status
  usart_int_stat = Chip_UART_GetIntStatus(usart->reg);
  fifo_int_stat  = Chip_UART_GetFIFOPendingInts (usart->reg);

  event = 0U;

  // TX FIFO level interrupt
  if (fifo_int_stat & UART_FIFOINT_TXLVL) {

    // Available space in FIFO
    cnt = 16U - UART_FIFOSTAT_TXLVL(Chip_UART_GetFIFOStatus(usart->reg));
    val = usart->info->xfer.tx_num - usart->info->xfer.tx_cnt;
    if (cnt > val) { cnt = val; }

    while (cnt != 0U) {
      cnt--;
      if (((usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_MASTER)  ||
           (usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE )) &&
           (usart->info->xfer.sync_mode == USART_SYNC_MODE_RX)) {

        // Dummy write in synchronous receive only mode
        usart->reg->FIFOWR = usart->info->xfer.tx_def_val;

      } else {
        data = *(usart->info->xfer.tx_buf++);
        if (usart->reg->CFG & UART_CFG_DATALEN_9) {
          // 9-bit data
          data |= (*(usart->info->xfer.tx_buf++)) << 8;
          
        }
        usart->reg->FIFOWR = data;
        usart->info->xfer.tx_cnt++;
      }
    }

    // Check if all data is transmitted
    if (usart->info->xfer.tx_cnt == usart->info->xfer.tx_num) {
      // Disable TX Ready interrupt
      Chip_UART_DisableFIFOInts (usart->reg, UART_FIFOINT_TXLVL);

      // Clear TX busy flag
      usart->info->xfer.send_active = 0U;

      // Set send complete event
      if ((usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
          (usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE )) {
        if ((usart->info->xfer.sync_mode == USART_SYNC_MODE_TX)    &&
            ((usart->info->xfer.receiver_enabled) == 0U)) {
          event |= ARM_USART_EVENT_SEND_COMPLETE;
        }
      } else {
        event |= ARM_USART_EVENT_SEND_COMPLETE;
      }

      // Enable USART TX IDLE interrupt
      Chip_UART_IntEnable (usart->reg, UART_INT_TXIDLE);
    }
  }

  // TX FIFO Error interrupt
  if (fifo_int_stat & UART_FIFOINT_TXERR) {
    // Update Status
    usart->info->status.tx_underflow = 1U;

    Chip_UART_ClearFIFOStatus (usart->reg, UART_FIFOINT_TXERR);
    if (Chip_UART_GetFIFOStatus (usart->reg) & UART_FIFOSTAT_TXEMPTY) {
      // TX under-run
      event |= ARM_USART_EVENT_TX_UNDERFLOW;
    }
  }

