qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/USART_LPC5411x.c
  // USART Transmitter IDLE interrupt
  if (usart_int_stat & UART_STAT_TXIDLE) {
    event |= ARM_USART_EVENT_TX_COMPLETE;
    // Disable USART TX IDLE interrupt
    Chip_UART_IntDisable (usart->reg, UART_INT_TXIDLE);
  }

  // USART Frame Error interrupt
  if (usart_int_stat & UART_STAT_FRM_ERRINT) {
    // Update Status
    usart->info->status.rx_framing_error = 1U;

    Chip_UART_ClearStatus (usart->reg, UART_STAT_FRM_ERRINT);
    event |= ARM_USART_EVENT_RX_FRAMING_ERROR;
  }

  // USART Parity Error interrupt
  if (usart_int_stat & UART_STAT_PAR_ERRINT) {
    // Update Status
    usart->info->status.rx_parity_error = 1U;

    Chip_UART_ClearStatus (usart->reg, UART_STAT_PAR_ERRINT);
    event |= ARM_USART_EVENT_RX_PARITY_ERROR;
  }

  // USART Break detect interrupt
  if (usart_int_stat & UART_STAT_DELTARXBRK) {
    // Update Status
    usart->info->status.rx_break = 1U;

    if (usart->reg->STAT & UART_STAT_RXBRK) {
      event |= ARM_USART_EVENT_RX_BREAK;
    }
    Chip_UART_ClearStatus (usart->reg, UART_STAT_DELTARXBRK);
  }

  // RX FIFO level interrupt
  if (fifo_int_stat & UART_FIFOINT_RXLVL) {
    cnt = UART_FIFOSTAT_RXLVL(Chip_UART_GetFIFOStatus(usart->reg));
    val = usart->info->xfer.rx_num - usart->info->xfer.rx_cnt;
    if (cnt > val) { cnt = val; }

    while (cnt != 0U) {
      cnt--;
      if (((usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_MASTER)  ||
           (usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE )) &&
           (usart->info->xfer.sync_mode == USART_SYNC_MODE_TX)) {
        // Dummy read in synchronous transmit only mode
        usart->reg->FIFORD;
      } else {
        // Read data
        data = usart->reg->FIFORD & 0x01FFU;
        *(usart->info->xfer.rx_buf++) = (uint8_t)data;
        if (usart->reg->CFG & UART_CFG_DATALEN_9) {
          // 9-bit data
          *(usart->info->xfer.rx_buf++) = (uint8_t)(data >> 8);
        }
        usart->info->xfer.rx_cnt++;
      }
    }

  // Check if requested amount of data is received
  if (usart->info->xfer.rx_cnt == usart->info->xfer.rx_num) {
    // Disable RX FIFO level interrupt
    Chip_UART_DisableFIFOInts (usart->reg, UART_FIFOINT_RXLVL);

      // Clear RX busy flag and set receive transfer complete event
      usart->info->status.rx_busy = 0U;
      if ((usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
          (usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE )) {
        val = usart->info->xfer.sync_mode;
        usart->info->xfer.sync_mode = 0U;
        switch (val) {
          case USART_SYNC_MODE_TX:
            event |= ARM_USART_EVENT_SEND_COMPLETE;
            break;
          case USART_SYNC_MODE_RX:
            event |= ARM_USART_EVENT_RECEIVE_COMPLETE;
            break;
          case USART_SYNC_MODE_TX_RX:
            event |= ARM_USART_EVENT_TRANSFER_COMPLETE;
            break;
          default: break;
        }
      } else {
        event |= ARM_USART_EVENT_RECEIVE_COMPLETE;
      }
    }
  }

  // RX FIFO Error interrupt
  if (fifo_int_stat & UART_FIFOINT_RXERR) {
    // Update Status
    usart->info->status.rx_overflow = 1U;

    Chip_UART_ClearFIFOStatus (usart->reg, UART_FIFOINT_RXERR);
    if (Chip_UART_GetFIFOStatus (usart->reg) & UART_FIFOSTAT_RXFULL) {
      // RX overrun
      event |= ARM_USART_EVENT_RX_OVERFLOW;
    }
  }

  // Modem interrupt
  if (usart_int_stat & UART_STAT_DELTACTS) {
    Chip_UART_ClearStatus (usart->reg, UART_STAT_DELTACTS);
    event |= ARM_USART_EVENT_CTS;
  }

  if ((usart->info->cb_event != NULL) && (event != 0U)) {
    usart->info->cb_event (event);
  }
}

#if USART_TX_DMA_USED
/**
  \fn          void USART_TX_DMA_IRQHandler (int32_t val, USART_RESOURCES *usart)
  \brief       USART Transmit DMA Interrupt handler.
*/
static void USART_TX_DMA_IRQHandler (int32_t val, USART_RESOURCES *usart) {
  uint32_t                  num;
  uint32_t                  data_addr;
  DMA_PERIPHERAL_CONTEXT_T  dma_context;

  // Set DMA interrupt flag
  usart->info->xfer.tx_dma_int_flag = 1U;

  usart->info->xfer.tx_cnt += usart->info->xfer.tx_num_pending;

  if (usart->info->xfer.tx_cnt < usart->info->xfer.tx_num) {
    // Still data to transmit
    data_addr = (uint32_t)usart->info->xfer.tx_buf;

    num = usart->info->xfer.tx_num - usart->info->xfer.tx_cnt;
    if (num > 1024U) { num = 1024U; }

    if (usart->info->xfer.tx_src_inc == DMA_XFERCFG_SRCINC_1) {
      usart->info->xfer.tx_buf += num;
    }
    usart->info->xfer.tx_num_pending = num;

    dma_context.width = DMA_XFERCFG_WIDTH_8;
    if (usart->reg->CFG & UART_CFG_DATALEN_9) {
      // 9-bit data
      dma_context.width = DMA_XFERCFG_WIDTH_16;
      if (usart->info->xfer.tx_src_inc == DMA_XFERCFG_SRCINC_1) {
        usart->info->xfer.tx_buf += num;
      }
      num *= 2;
    }                         
    dma_context.channel           = usart->dma_tx->chid;
    dma_context.register_location = &(usart->reg->FIFOWR);
    dma_context.dst_increment     = DMA_XFERCFG_DSTINC_0;
    dma_context.src_increment     = usart->info->xfer.tx_src_inc;
    dma_context.write             = 1U;

    Chip_DMASERVICE_SingleBuffer (&dma_context, data_addr, num);
  } else {
    // All requested data has been transmitted

    // Clear TX busy flag
    usart->info->xfer.send_active = 0U;

    // Enable USART TX IDLE interrupt
    Chip_UART_IntEnable (usart->reg, UART_INT_TXIDLE);

    // Set Send Complete event for asynchronous transfers
    if ((usart->info->mode != ARM_USART_MODE_SYNCHRONOUS_MASTER) &&
        (usart->info->mode != ARM_USART_MODE_SYNCHRONOUS_SLAVE )) {
      if (usart->info->cb_event) {
        usart->info->cb_event (ARM_USART_EVENT_SEND_COMPLETE);
      }
    }
  }
}
#endif

#if USART_RX_DMA_USED
/**
  \fn          void USART_RX_DMA_IRQHandler (int32_t val, USART_RESOURCES *usart)
  \brief       USART Receive DMA Interrupt handler.
*/
static void USART_RX_DMA_IRQHandler (int32_t val, USART_RESOURCES *usart) {
  uint32_t                  num, data_addr, evt = 0U;
  DMA_PERIPHERAL_CONTEXT_T  dma_context;

  // Set DMA interrupt flag
  usart->info->xfer.rx_dma_int_flag = 1U;

  usart->info->xfer.rx_cnt += usart->info->xfer.rx_num_pending;

