qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/USART_LPC5411x.c
  if (usart->info->xfer.rx_cnt < usart->info->xfer.rx_num) {
    // Still data to receive
    data_addr = (uint32_t)usart->info->xfer.rx_buf;

    num = usart->info->xfer.rx_num - usart->info->xfer.rx_cnt;
    if (num > 1024U) { num = 1024U; }

    if (usart->info->xfer.rx_dest_inc == DMA_XFERCFG_DSTINC_1) {
      usart->info->xfer.rx_buf      += num;
    }
    usart->info->xfer.rx_num_pending = num;

    dma_context.width = DMA_XFERCFG_WIDTH_8;
    if (usart->reg->CFG & UART_CFG_DATALEN_9) {
      // 9-bit data
      dma_context.width = DMA_XFERCFG_WIDTH_16;
      if (usart->info->xfer.rx_dest_inc == DMA_XFERCFG_DSTINC_1) {
        usart->info->xfer.rx_buf += num;
      }
      num *= 2;
    }                         
    dma_context.channel           = usart->dma_rx->chid;
    dma_context.register_location = (volatile uint32_t *)&(usart->reg->FIFORD);
    dma_context.dst_increment     = usart->info->xfer.rx_dest_inc;
    dma_context.src_increment     = DMA_XFERCFG_SRCINC_0;
    dma_context.write             = 0U;

    Chip_DMASERVICE_SingleBuffer (&dma_context, data_addr, num);
  } else {
    // All requested data has been received

    // Clear busy flag
    usart->info->status.rx_busy = 0U;

    if ((usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
        (usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE )) {
      val = usart->info->xfer.sync_mode;
      usart->info->xfer.sync_mode = 0U;
      switch (val) {
        case USART_SYNC_MODE_TX:
          evt |= ARM_USART_EVENT_SEND_COMPLETE;
          break;
        case USART_SYNC_MODE_RX:
          evt |= ARM_USART_EVENT_RECEIVE_COMPLETE;
          break;
        case USART_SYNC_MODE_TX_RX:
          evt |= ARM_USART_EVENT_TRANSFER_COMPLETE;
           break;
        default: break;
      }
    } else {
      evt |= ARM_USART_EVENT_RECEIVE_COMPLETE;
    }

    if ((usart->info->cb_event != NULL) && (evt != 0U)) {
      usart->info->cb_event (evt);
    }
  }
}
#endif

#if (RTE_USART0)
// USART0 Driver Wrapper functions
static ARM_USART_CAPABILITIES USART0_GetCapabilities (void) {
  return USART_GetCapabilities (&USART0_Resources);
}
static int32_t USART0_Initialize (ARM_USART_SignalEvent_t cb_event) {
  return USART_Initialize (cb_event, &USART0_Resources);
}
static int32_t USART0_Uninitialize (void) {
  return USART_Uninitialize(&USART0_Resources);
}
static int32_t USART0_PowerControl (ARM_POWER_STATE state) {
  return USART_PowerControl (state, &USART0_Resources);
}
static int32_t USART0_Send (const void *data, uint32_t num) {
  return USART_Send (data, num, &USART0_Resources);
}
static int32_t USART0_Receive (void *data, uint32_t num) {
  return USART_Receive (data, num, &USART0_Resources);
}
static int32_t USART0_Transfer (const void      *data_out,
                                      void      *data_in,
                                      uint32_t   num) {
  return USART_Transfer (data_out, data_in, num, &USART0_Resources);
}
static uint32_t USART0_GetTxCount (void) {
  return USART_GetTxCount (&USART0_Resources);
}
static uint32_t USART0_GetRxCount (void) {
  return USART_GetRxCount (&USART0_Resources); 
}
static int32_t USART0_Control (uint32_t control, uint32_t arg) {
  return USART_Control (control, arg, &USART0_Resources);
}
static ARM_USART_STATUS USART0_GetStatus (void) {
  return USART_GetStatus (&USART0_Resources);
}
static int32_t USART0_SetModemControl (ARM_USART_MODEM_CONTROL control) {
  return USART_SetModemControl (control, &USART0_Resources);
}
static ARM_USART_MODEM_STATUS USART0_GetModemStatus (void) {
  return USART_GetModemStatus (&USART0_Resources);
}
void USART0_IRQHandler (void) {
  USART_IRQHandler (&USART0_Resources);
}

#if (USART0_TX_DMA_EN != 0)
void USART0_TX_DMA_Callback (int32_t val) {
  USART_TX_DMA_IRQHandler (val, &USART0_Resources);
}
#endif
#if (USART0_RX_DMA_EN != 0)
void USART0_RX_DMA_Callback (int32_t val) {
  USART_RX_DMA_IRQHandler (val, &USART0_Resources);
}
#endif

// USART0 Driver Control Block
ARM_DRIVER_USART Driver_USART0 = {
    USARTx_GetVersion,
    USART0_GetCapabilities,
    USART0_Initialize,
    USART0_Uninitialize,
    USART0_PowerControl,
    USART0_Send, 
    USART0_Receive,
    USART0_Transfer,
    USART0_GetTxCount,
    USART0_GetRxCount,
    USART0_Control,
    USART0_GetStatus,
    USART0_SetModemControl,
    USART0_GetModemStatus
};
#endif

#if (RTE_USART1)
// USART1 Driver Wrapper functions
static ARM_USART_CAPABILITIES USART1_GetCapabilities (void) {
  return USART_GetCapabilities (&USART1_Resources);
}
static int32_t USART1_Initialize (ARM_USART_SignalEvent_t cb_event) {
  return USART_Initialize (cb_event, &USART1_Resources);
}
static int32_t USART1_Uninitialize (void) {
  return USART_Uninitialize(&USART1_Resources);
}
static int32_t USART1_PowerControl (ARM_POWER_STATE state) {
  return USART_PowerControl (state, &USART1_Resources);
}
static int32_t USART1_Send (const void *data, uint32_t num) {
  return USART_Send (data, num, &USART1_Resources);
}
static int32_t USART1_Receive (void *data, uint32_t num) {
  return USART_Receive (data, num, &USART1_Resources);
}
static int32_t USART1_Transfer (const void      *data_out,
                                      void      *data_in,
                                      uint32_t   num) {
  return USART_Transfer (data_out, data_in, num, &USART1_Resources);
}
static uint32_t USART1_GetTxCount (void) {
  return USART_GetTxCount (&USART1_Resources);
}
static uint32_t USART1_GetRxCount (void) {
  return USART_GetRxCount (&USART1_Resources); 
}
static int32_t USART1_Control (uint32_t control, uint32_t arg) {
  return USART_Control (control, arg, &USART1_Resources);
}
static ARM_USART_STATUS USART1_GetStatus (void) {
  return USART_GetStatus (&USART1_Resources);
}
static int32_t USART1_SetModemControl (ARM_USART_MODEM_CONTROL control) {
  return USART_SetModemControl (control, &USART1_Resources);
}
static ARM_USART_MODEM_STATUS USART1_GetModemStatus (void) {
  return USART_GetModemStatus (&USART1_Resources);
}
void USART1_IRQHandler (void) {
  USART_IRQHandler (&USART1_Resources);
}
#if (USART1_TX_DMA_EN != 0)
void USART1_TX_DMA_Callback (int32_t val) {
  USART_TX_DMA_IRQHandler (val, &USART1_Resources);
}
#endif
#if (USART1_RX_DMA_EN != 0)
void USART1_RX_DMA_Callback (int32_t val) {
  USART_RX_DMA_IRQHandler (val, &USART1_Resources);
}
#endif

