qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/USART_LPC5411x.c
// USART1 Driver Control Block
ARM_DRIVER_USART Driver_USART1 = {
    USARTx_GetVersion,
    USART1_GetCapabilities,
    USART1_Initialize,
    USART1_Uninitialize,
    USART1_PowerControl,
    USART1_Send, 
    USART1_Receive,
    USART1_Transfer,
    USART1_GetTxCount,
    USART1_GetRxCount,
    USART1_Control,
    USART1_GetStatus,
    USART1_SetModemControl,
    USART1_GetModemStatus
};
#endif

#if (RTE_USART2)
// USART2 Driver Wrapper functions
static ARM_USART_CAPABILITIES USART2_GetCapabilities (void) {
  return USART_GetCapabilities (&USART2_Resources);
}
static int32_t USART2_Initialize (ARM_USART_SignalEvent_t cb_event) {
  return USART_Initialize (cb_event, &USART2_Resources);
}
static int32_t USART2_Uninitialize (void) {
  return USART_Uninitialize(&USART2_Resources);
}
static int32_t USART2_PowerControl (ARM_POWER_STATE state) {
  return USART_PowerControl (state, &USART2_Resources);
}
static int32_t USART2_Send (const void *data, uint32_t num) {
  return USART_Send (data, num, &USART2_Resources);
}
static int32_t USART2_Receive (void *data, uint32_t num) {
  return USART_Receive (data, num, &USART2_Resources);
}
static int32_t USART2_Transfer (const void      *data_out,
                                      void      *data_in,
                                      uint32_t   num) {
  return USART_Transfer (data_out, data_in, num, &USART2_Resources);
}
static uint32_t USART2_GetTxCount (void) {
  return USART_GetTxCount (&USART2_Resources);
}
static uint32_t USART2_GetRxCount (void) {
  return USART_GetRxCount (&USART2_Resources); 
}
static int32_t USART2_Control (uint32_t control, uint32_t arg) {
  return USART_Control (control, arg, &USART2_Resources);
}
static ARM_USART_STATUS USART2_GetStatus (void) {
  return USART_GetStatus (&USART2_Resources);
}
static int32_t USART2_SetModemControl (ARM_USART_MODEM_CONTROL control) {
  return USART_SetModemControl (control, &USART2_Resources);
}
static ARM_USART_MODEM_STATUS USART2_GetModemStatus (void) {
  return USART_GetModemStatus (&USART2_Resources);
}
void USART2_IRQHandler (void) {
  USART_IRQHandler (&USART2_Resources);
}
#if (USART2_TX_DMA_EN != 0)
void USART2_TX_DMA_Callback (int32_t val) {
  USART_TX_DMA_IRQHandler (val, &USART2_Resources);
}
#endif
#if (USART2_RX_DMA_EN != 0)
void USART2_RX_DMA_Callback (int32_t val) {
  USART_RX_DMA_IRQHandler (val, &USART2_Resources);
}
#endif

// USART2 Driver Control Block
ARM_DRIVER_USART Driver_USART2 = {
    USARTx_GetVersion,
    USART2_GetCapabilities,
    USART2_Initialize,
    USART2_Uninitialize,
    USART2_PowerControl,
    USART2_Send, 
    USART2_Receive,
    USART2_Transfer,
    USART2_GetTxCount,
    USART2_GetRxCount,
    USART2_Control,
    USART2_GetStatus,
    USART2_SetModemControl,
    USART2_GetModemStatus
};
#endif

#if (RTE_USART3)
// USART3 Driver Wrapper functions
static ARM_USART_CAPABILITIES USART3_GetCapabilities (void) {
  return USART_GetCapabilities (&USART3_Resources);
}
static int32_t USART3_Initialize (ARM_USART_SignalEvent_t cb_event) {
  return USART_Initialize (cb_event, &USART3_Resources);
}
static int32_t USART3_Uninitialize (void) {
  return USART_Uninitialize(&USART3_Resources);
}
static int32_t USART3_PowerControl (ARM_POWER_STATE state) {
  return USART_PowerControl (state, &USART3_Resources);
}
static int32_t USART3_Send (const void *data, uint32_t num) {
  return USART_Send (data, num, &USART3_Resources);
}
static int32_t USART3_Receive (void *data, uint32_t num) {
  return USART_Receive (data, num, &USART3_Resources);
}
static int32_t USART3_Transfer (const void      *data_out,
                                      void      *data_in,
                                      uint32_t   num) {
  return USART_Transfer (data_out, data_in, num, &USART3_Resources);
}
static uint32_t USART3_GetTxCount (void) {
  return USART_GetTxCount (&USART3_Resources);
}
static uint32_t USART3_GetRxCount (void) {
  return USART_GetRxCount (&USART3_Resources); 
}
static int32_t USART3_Control (uint32_t control, uint32_t arg) {
  return USART_Control (control, arg, &USART3_Resources);
}
static ARM_USART_STATUS USART3_GetStatus (void) {
  return USART_GetStatus (&USART3_Resources);
}
static int32_t USART3_SetModemControl (ARM_USART_MODEM_CONTROL control) {
  return USART_SetModemControl (control, &USART3_Resources);
}
static ARM_USART_MODEM_STATUS USART3_GetModemStatus (void) {
  return USART_GetModemStatus (&USART3_Resources);
}
void USART3_IRQHandler (void) {
  USART_IRQHandler (&USART3_Resources);
}
#if (USART3_TX_DMA_EN != 0)
void USART3_TX_DMA_Callback (int32_t val) {
  USART_TX_DMA_IRQHandler (val, &USART3_Resources);
}
#endif
#if (USART3_RX_DMA_EN != 0)
void USART3_RX_DMA_Callback (int32_t val) {
  USART_RX_DMA_IRQHandler (val, &USART3_Resources);
}
#endif

// USART3 Driver Control Block
ARM_DRIVER_USART Driver_USART3 = {
    USARTx_GetVersion,
    USART3_GetCapabilities,
    USART3_Initialize,
    USART3_Uninitialize,
    USART3_PowerControl,
    USART3_Send, 
    USART3_Receive,
    USART3_Transfer,
    USART3_GetTxCount,
    USART3_GetRxCount,
    USART3_Control,
    USART3_GetStatus,
    USART3_SetModemControl,
    USART3_GetModemStatus
};
#endif

#if (RTE_USART4)
// USART4 Driver Wrapper functions
static ARM_USART_CAPABILITIES USART4_GetCapabilities (void) {
  return USART_GetCapabilities (&USART4_Resources);
}
static int32_t USART4_Initialize (ARM_USART_SignalEvent_t cb_event) {
  return USART_Initialize (cb_event, &USART4_Resources);
}
static int32_t USART4_Uninitialize (void) {
  return USART_Uninitialize(&USART4_Resources);
}
static int32_t USART4_PowerControl (ARM_POWER_STATE state) {
  return USART_PowerControl (state, &USART4_Resources);
}
static int32_t USART4_Send (const void *data, uint32_t num) {
  return USART_Send (data, num, &USART4_Resources);
}
static int32_t USART4_Receive (void *data, uint32_t num) {
  return USART_Receive (data, num, &USART4_Resources);
}
static int32_t USART4_Transfer (const void      *data_out,
                                      void      *data_in,
                                      uint32_t   num) {
  return USART_Transfer (data_out, data_in, num, &USART4_Resources);
}
static uint32_t USART4_GetTxCount (void) {
  return USART_GetTxCount (&USART4_Resources);
}
static uint32_t USART4_GetRxCount (void) {
  return USART_GetRxCount (&USART4_Resources); 
}
static int32_t USART4_Control (uint32_t control, uint32_t arg) {
  return USART_Control (control, arg, &USART4_Resources);
}
static ARM_USART_STATUS USART4_GetStatus (void) {
  return USART_GetStatus (&USART4_Resources);
}
static int32_t USART4_SetModemControl (ARM_USART_MODEM_CONTROL control) {
  return USART_SetModemControl (control, &USART4_Resources);
}
static ARM_USART_MODEM_STATUS USART4_GetModemStatus (void) {
  return USART_GetModemStatus (&USART4_Resources);
}
void USART4_IRQHandler (void) {
  USART_IRQHandler (&USART4_Resources);
}
#if (USART4_TX_DMA_EN != 0)
void USART4_TX_DMA_Callback (int32_t val) {
  USART_TX_DMA_IRQHandler (val, &USART4_Resources);
}
#endif
#if (USART4_RX_DMA_EN != 0)
void USART4_RX_DMA_Callback (int32_t val) {
  USART_RX_DMA_IRQHandler (val, &USART4_Resources);
}
#endif

