qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/USART_LPC5411x.c
// USART4 Driver Control Block
ARM_DRIVER_USART Driver_USART4 = {
    USARTx_GetVersion,
    USART4_GetCapabilities,
    USART4_Initialize,
    USART4_Uninitialize,
    USART4_PowerControl,
    USART4_Send, 
    USART4_Receive,
    USART4_Transfer,
    USART4_GetTxCount,
    USART4_GetRxCount,
    USART4_Control,
    USART4_GetStatus,
    USART4_SetModemControl,
    USART4_GetModemStatus
};
#endif

#if (RTE_USART5)
// USART5 Driver Wrapper functions
static ARM_USART_CAPABILITIES USART5_GetCapabilities (void) {
  return USART_GetCapabilities (&USART5_Resources);
}
static int32_t USART5_Initialize (ARM_USART_SignalEvent_t cb_event) {
  return USART_Initialize (cb_event, &USART5_Resources);
}
static int32_t USART5_Uninitialize (void) {
  return USART_Uninitialize(&USART5_Resources);
}
static int32_t USART5_PowerControl (ARM_POWER_STATE state) {
  return USART_PowerControl (state, &USART5_Resources);
}
static int32_t USART5_Send (const void *data, uint32_t num) {
  return USART_Send (data, num, &USART5_Resources);
}
static int32_t USART5_Receive (void *data, uint32_t num) {
  return USART_Receive (data, num, &USART5_Resources);
}
static int32_t USART5_Transfer (const void      *data_out,
                                      void      *data_in,
                                      uint32_t   num) {
  return USART_Transfer (data_out, data_in, num, &USART5_Resources);
}
static uint32_t USART5_GetTxCount (void) {
  return USART_GetTxCount (&USART5_Resources);
}
static uint32_t USART5_GetRxCount (void) {
  return USART_GetRxCount (&USART5_Resources); 
}
static int32_t USART5_Control (uint32_t control, uint32_t arg) {
  return USART_Control (control, arg, &USART5_Resources);
}
static ARM_USART_STATUS USART5_GetStatus (void) {
  return USART_GetStatus (&USART5_Resources);
}
static int32_t USART5_SetModemControl (ARM_USART_MODEM_CONTROL control) {
  return USART_SetModemControl (control, &USART5_Resources);
}
static ARM_USART_MODEM_STATUS USART5_GetModemStatus (void) {
  return USART_GetModemStatus (&USART5_Resources);
}
void USART5_IRQHandler (void) {
  USART_IRQHandler (&USART5_Resources);
}
#if (USART5_TX_DMA_EN != 0)
void USART5_TX_DMA_Callback (int32_t val) {
  USART_TX_DMA_IRQHandler (val, &USART5_Resources);
}
#endif
#if (USART5_RX_DMA_EN != 0)
void USART5_RX_DMA_Callback (int32_t val) {
  USART_RX_DMA_IRQHandler (val, &USART5_Resources);
}
#endif

// USART5 Driver Control Block
ARM_DRIVER_USART Driver_USART5 = {
    USARTx_GetVersion,
    USART5_GetCapabilities,
    USART5_Initialize,
    USART5_Uninitialize,
    USART5_PowerControl,
    USART5_Send, 
    USART5_Receive,
    USART5_Transfer,
    USART5_GetTxCount,
    USART5_GetRxCount,
    USART5_Control,
    USART5_GetStatus,
    USART5_SetModemControl,
    USART5_GetModemStatus
};
#endif

#if (RTE_USART6)
// USART6 Driver Wrapper functions
static ARM_USART_CAPABILITIES USART6_GetCapabilities (void) {
  return USART_GetCapabilities (&USART6_Resources);
}
static int32_t USART6_Initialize (ARM_USART_SignalEvent_t cb_event) {
  return USART_Initialize (cb_event, &USART6_Resources);
}
static int32_t USART6_Uninitialize (void) {
  return USART_Uninitialize(&USART6_Resources);
}
static int32_t USART6_PowerControl (ARM_POWER_STATE state) {
  return USART_PowerControl (state, &USART6_Resources);
}
static int32_t USART6_Send (const void *data, uint32_t num) {
  return USART_Send (data, num, &USART6_Resources);
}
static int32_t USART6_Receive (void *data, uint32_t num) {
  return USART_Receive (data, num, &USART6_Resources);
}
static int32_t USART6_Transfer (const void      *data_out,
                                      void      *data_in,
                                      uint32_t   num) {
  return USART_Transfer (data_out, data_in, num, &USART6_Resources);
}
static uint32_t USART6_GetTxCount (void) {
  return USART_GetTxCount (&USART6_Resources);
}
static uint32_t USART6_GetRxCount (void) {
  return USART_GetRxCount (&USART6_Resources); 
}
static int32_t USART6_Control (uint32_t control, uint32_t arg) {
  return USART_Control (control, arg, &USART6_Resources);
}
static ARM_USART_STATUS USART6_GetStatus (void) {
  return USART_GetStatus (&USART6_Resources);
}
static int32_t USART6_SetModemControl (ARM_USART_MODEM_CONTROL control) {
  return USART_SetModemControl (control, &USART6_Resources);
}
static ARM_USART_MODEM_STATUS USART6_GetModemStatus (void) {
  return USART_GetModemStatus (&USART6_Resources);
}
void USART6_IRQHandler (void) {
  USART_IRQHandler (&USART6_Resources);
}
#if (USART6_TX_DMA_EN != 0)
void USART6_TX_DMA_Callback (int32_t val) {
  USART_TX_DMA_IRQHandler (val, &USART6_Resources);
}
#endif
#if (USART6_RX_DMA_EN != 0)
void USART6_RX_DMA_Callback (int32_t val) {
  USART_RX_DMA_IRQHandler (val, &USART6_Resources);
}
#endif

// USART6 Driver Control Block
ARM_DRIVER_USART Driver_USART6 = {
    USARTx_GetVersion,
    USART6_GetCapabilities,
    USART6_Initialize,
    USART6_Uninitialize,
    USART6_PowerControl,
    USART6_Send, 
    USART6_Receive,
    USART6_Transfer,
    USART6_GetTxCount,
    USART6_GetRxCount,
    USART6_Control,
    USART6_GetStatus,
    USART6_SetModemControl,
    USART6_GetModemStatus
};
#endif

#if (RTE_USART7)
// USART7 Driver Wrapper functions
static ARM_USART_CAPABILITIES USART7_GetCapabilities (void) {
  return USART_GetCapabilities (&USART7_Resources);
}
static int32_t USART7_Initialize (ARM_USART_SignalEvent_t cb_event) {
  return USART_Initialize (cb_event, &USART7_Resources);
}
static int32_t USART7_Uninitialize (void) {
  return USART_Uninitialize(&USART7_Resources);
}
static int32_t USART7_PowerControl (ARM_POWER_STATE state) {
  return USART_PowerControl (state, &USART7_Resources);
}
static int32_t USART7_Send (const void *data, uint32_t num) {
  return USART_Send (data, num, &USART7_Resources);
}
static int32_t USART7_Receive (void *data, uint32_t num) {
  return USART_Receive (data, num, &USART7_Resources);
}
static int32_t USART7_Transfer (const void      *data_out,
                                      void      *data_in,
                                      uint32_t   num) {
  return USART_Transfer (data_out, data_in, num, &USART7_Resources);
}
static uint32_t USART7_GetTxCount (void) {
  return USART_GetTxCount (&USART7_Resources);
}
static uint32_t USART7_GetRxCount (void) {
  return USART_GetRxCount (&USART7_Resources); 
}
static int32_t USART7_Control (uint32_t control, uint32_t arg) {
  return USART_Control (control, arg, &USART7_Resources);
}
static ARM_USART_STATUS USART7_GetStatus (void) {
  return USART_GetStatus (&USART7_Resources);
}
static int32_t USART7_SetModemControl (ARM_USART_MODEM_CONTROL control) {
  return USART_SetModemControl (control, &USART7_Resources);
}
static ARM_USART_MODEM_STATUS USART7_GetModemStatus (void) {
  return USART_GetModemStatus (&USART7_Resources);
}
void USART7_IRQHandler (void) {
  USART_IRQHandler (&USART7_Resources);
}
#if (USART7_TX_DMA_EN != 0)
void USART7_TX_DMA_Callback (int32_t val) {
  USART_TX_DMA_IRQHandler (val, &USART7_Resources);
}
#endif
#if (USART7_RX_DMA_EN != 0)
void USART7_RX_DMA_Callback (int32_t val) {
  USART_RX_DMA_IRQHandler (val, &USART7_Resources);
}
#endif

// USART7 Driver Control Block
ARM_DRIVER_USART Driver_USART7 = {
    USARTx_GetVersion,
    USART7_GetCapabilities,
    USART7_Initialize,
    USART7_Uninitialize,
    USART7_PowerControl,
    USART7_Send, 
    USART7_Receive,
    USART7_Transfer,
    USART7_GetTxCount,
    USART7_GetRxCount,
    USART7_Control,
    USART7_GetStatus,
    USART7_SetModemControl,
    USART7_GetModemStatus
};
#endif
